sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/*!
    \file    gd32a7xx_can.h
    \brief   definitions for the CAN

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_CAN_H
#define GD32A7XX_CAN_H

#include "gd32a7xx.h"
#include "stdlib.h"

/* CAN definitions */
/* CAN base addresses */
#define CAN0                          CAN_BASE                                            /*!< CAN0 base address */
#define CAN1                          (CAN_BASE + 0x00004000U)                            /*!< CAN1 base address */
#define CAN2                          (CAN_BASE + 0x00010000U)                            /*!< CAN2 base address */
/* CAN system registers offset address from base address */
#define CAN_SYSREG_OFFSET             (0x00001800U)                                       /*!< CAN system registers offset */

/* registers definitions */
/* SYSREG registers definitions */
#define CAN_MRAM(canx)                REG32((canx) + CAN_SYSREG_OFFSET + 0x00000000U)     /*!< CAN MRAM initialization register */
#define CAN_DMR(canx)                 REG32((canx) + CAN_SYSREG_OFFSET + 0x00000020U)     /*!< CAN disable modification on read register */
#define CAN_CSR(canx)                 REG32((canx) + CAN_SYSREG_OFFSET + 0x00000024U)     /*!< CAN clock stop request register */
#define CAN_CSA(canx)                 REG32((canx) + CAN_SYSREG_OFFSET + 0x00000028U)     /*!< CAN clock stop acknowledge register */
#define CAN_CTL(canx)                 REG32((canx) + CAN_SYSREG_OFFSET + 0x00000070U)     /*!< CAN control register */
#define CAN_MERRCTL(canx)             REG32((canx) + CAN_SYSREG_OFFSET + 0x00000080U)     /*!< CAN memory error control register */
#define CAN_CERRR0(canx)              REG32((canx) + CAN_SYSREG_OFFSET + 0x00000084U)     /*!< CAN correctable error record register 0 */
#define CAN_CERRR1(canx)              REG32((canx) + CAN_SYSREG_OFFSET + 0x00000088U)     /*!< CAN correctable error record register 1 */
#define CAN_CERRR2(canx)              REG32((canx) + CAN_SYSREG_OFFSET + 0x0000008CU)     /*!< CAN correctable error record register 2 */
#define CAN_CERRR3(canx)              REG32((canx) + CAN_SYSREG_OFFSET + 0x00000090U)     /*!< CAN correctable error record register 3 */
#define CAN_NCERRR(canx)              REG32((canx) + CAN_SYSREG_OFFSET + 0x00000094U)     /*!< CAN noncorrectable error record register */
#define CAN_MERRSTAT(canx)            REG32((canx) + CAN_SYSREG_OFFSET + 0x0000009CU)     /*!< CAN memory error status register */
/* M_CAN registers definitions */
#define CAN_M_CAN_CREL(dtm_canx)      REG32((dtm_canx) + 0x00U)                           /*!< M_CAN core release register */
#define CAN_M_CAN_ENDN(dtm_canx)      REG32((dtm_canx) + 0x04U)                           /*!< M_CAN endian register */
#define CAN_M_CAN_DBTP(dtm_canx)      REG32((dtm_canx) + 0x0CU)                           /*!< M_CAN data bit timing and prescaler register */
#define CAN_M_CAN_TEST(dtm_canx)      REG32((dtm_canx) + 0x10U)                           /*!< M_CAN test register */
#define CAN_M_CAN_RWD(dtm_canx)       REG32((dtm_canx) + 0x14U)                           /*!< M_CAN RAM watchdog register */
#define CAN_M_CAN_CCCR(dtm_canx)      REG32((dtm_canx) + 0x18U)                           /*!< M_CAN CC control register */
#define CAN_M_CAN_NBTP(dtm_canx)      REG32((dtm_canx) + 0x1CU)                           /*!< M_CAN nominal bit timing and prescaler register */
#define CAN_M_CAN_TSCC(dtm_canx)      REG32((dtm_canx) + 0x20U)                           /*!< M_CAN timestamp counter configuration register */
#define CAN_M_CAN_TSCV(dtm_canx)      REG32((dtm_canx) + 0x24U)                           /*!< M_CAN timestamp counter value register */
#define CAN_M_CAN_TOCC(dtm_canx)      REG32((dtm_canx) + 0x28U)                           /*!< M_CAN timeout counter configuration register */
#define CAN_M_CAN_TOCV(dtm_canx)      REG32((dtm_canx) + 0x2CU)                           /*!< M_CAN timeout counter value register */
#define CAN_M_CAN_ECR(dtm_canx)       REG32((dtm_canx) + 0x40U)                           /*!< M_CAN error counter register */
#define CAN_M_CAN_PSR(dtm_canx)       REG32((dtm_canx) + 0x44U)                           /*!< M_CAN protocol status register */
#define CAN_M_CAN_TDCR(dtm_canx)      REG32((dtm_canx) + 0x48U)                           /*!< M_CAN transmitter delay compensation register */
#define CAN_M_CAN_IR(dtm_canx)        REG32((dtm_canx) + 0x50U)                           /*!< M_CAN interrupt register */
#define CAN_M_CAN_IE(dtm_canx)        REG32((dtm_canx) + 0x54U)                           /*!< M_CAN interrupt enable register */
#define CAN_M_CAN_ILS(dtm_canx)       REG32((dtm_canx) + 0x58U)                           /*!< M_CAN interrupt line select register */
#define CAN_M_CAN_ILE(dtm_canx)       REG32((dtm_canx) + 0x5CU)                           /*!< M_CAN interrupt line enable register */
#define CAN_M_CAN_GFC(dtm_canx)       REG32((dtm_canx) + 0x80U)                           /*!< M_CAN global filter configuration register */
#define CAN_M_CAN_SIDFC(dtm_canx)     REG32((dtm_canx) + 0x84U)                           /*!< M_CAN standard ID filter configuration register */
#define CAN_M_CAN_XIDFC(dtm_canx)     REG32((dtm_canx) + 0x88U)                           /*!< M_CAN extended ID filter configuration register */
#define CAN_M_CAN_XIDAM(dtm_canx)     REG32((dtm_canx) + 0x90U)                           /*!< M_CAN extended ID AND mask register */
#define CAN_M_CAN_HPMS(dtm_canx)      REG32((dtm_canx) + 0x94U)                           /*!< M_CAN high priority message status register */
#define CAN_M_CAN_NDAT1(dtm_canx)     REG32((dtm_canx) + 0x98U)                           /*!< M_CAN new data 1 register */
#define CAN_M_CAN_NDAT2(dtm_canx)     REG32((dtm_canx) + 0x9CU)                           /*!< M_CAN new data 2 register */
#define CAN_M_CAN_RXF0C(dtm_canx)     REG32((dtm_canx) + 0xA0U)                           /*!< M_CAN Rx FIFO 0 configuration register */
#define CAN_M_CAN_RXF0S(dtm_canx)     REG32((dtm_canx) + 0xA4U)                           /*!< M_CAN Rx FIFO 0 status register */
#define CAN_M_CAN_RXF0A(dtm_canx)     REG32((dtm_canx) + 0xA8U)                           /*!< M_CAN Rx FIFO 0 acknowledge register */
#define CAN_M_CAN_RXBC(dtm_canx)      REG32((dtm_canx) + 0xACU)                           /*!< M_CAN Rx buffer configuration register */
#define CAN_M_CAN_RXF1C(dtm_canx)     REG32((dtm_canx) + 0xB0U)                           /*!< M_CAN Rx FIFO 1 configuration register */
#define CAN_M_CAN_RXF1S(dtm_canx)     REG32((dtm_canx) + 0xB4U)                           /*!< M_CAN Rx FIFO 1 status register */
#define CAN_M_CAN_RXF1A(dtm_canx)     REG32((dtm_canx) + 0xB8U)                           /*!< M_CAN Rx FIFO 1 acknowledge register */
#define CAN_M_CAN_RXESC(dtm_canx)     REG32((dtm_canx) + 0xBCU)                           /*!< M_CAN Rx buffer/FIFO element size configuration register */
#define CAN_M_CAN_TXBC(dtm_canx)      REG32((dtm_canx) + 0xC0U)                           /*!< M_CAN Tx buffer configuration register */
#define CAN_M_CAN_TXFQS(dtm_canx)     REG32((dtm_canx) + 0xC4U)                           /*!< M_CAN Tx FIFO/queue status register */
#define CAN_M_CAN_TXESC(dtm_canx)     REG32((dtm_canx) + 0xC8U)                           /*!< M_CAN Tx buffer element size configuration register */
#define CAN_M_CAN_TXBRP(dtm_canx)     REG32((dtm_canx) + 0xCCU)                           /*!< M_CAN Tx buffer request pending register */
#define CAN_M_CAN_TXBAR(dtm_canx)     REG32((dtm_canx) + 0xD0U)                           /*!< M_CAN Tx buffer add request register */
#define CAN_M_CAN_TXBCR(dtm_canx)     REG32((dtm_canx) + 0xD4U)                           /*!< M_CAN Tx buffer cancellation request register */
#define CAN_M_CAN_TXBTO(dtm_canx)     REG32((dtm_canx) + 0xD8U)                           /*!< M_CAN Tx buffer transmission occurred register */
#define CAN_M_CAN_TXBCF(dtm_canx)     REG32((dtm_canx) + 0xDCU)                           /*!< M_CAN Tx buffer cancellation finished register */
#define CAN_M_CAN_TXBTIE(dtm_canx)    REG32((dtm_canx) + 0xE0U)                           /*!< M_CAN Tx buffer transmission interrupt enable register */
#define CAN_M_CAN_TXBCIE(dtm_canx)    REG32((dtm_canx) + 0xE4U)                           /*!< M_CAN Tx buffer cancellation finished interrupt enable register */
#define CAN_M_CAN_TXEFC(dtm_canx)     REG32((dtm_canx) + 0xF0U)                           /*!< M_CAN Tx event FIFO configuration register */
#define CAN_M_CAN_TXEFS(dtm_canx)     REG32((dtm_canx) + 0xF4U)                           /*!< M_CAN Tx event FIFO status register */
#define CAN_M_CAN_TXEFA(dtm_canx)     REG32((dtm_canx) + 0xF8U)                           /*!< M_CAN Tx event FIFO acknowledge register */
/* DMU registers definitions */
#define CAN_DMU_DMUCR(dtm_canx)       REG32((dtm_canx) + 0x000003C0U)                     /*!< DMU control register */
#define CAN_DMU_DMUI(dtm_canx)        REG32((dtm_canx) + 0x000003C4U)                     /*!< DMU interface register */
#define CAN_DMU_DMUQC(dtm_canx)       REG32((dtm_canx) + 0x000003C8U)                     /*!< DMU queue control register */
#define CAN_DMU_DMUIR(dtm_canx)       REG32((dtm_canx) + 0x000003CCU)                     /*!< DMU interrupt register */
#define CAN_DMU_DMUIE(dtm_canx)       REG32((dtm_canx) + 0x000003D0U)                     /*!< DMU interrupt enable register */
#define CAN_DMU_DMUC(dtm_canx)        REG32((dtm_canx) + 0x000003D4U)                     /*!< DMU configuration register */

