sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* bits definitions */
/* CAN_MRAM */
#define CAN_MRAM_IRF                  BIT(0)                                              /*!< CAN share message SRAM initialization finish */

/* CAN_DMR */
#define CAN_DMR_DMORD0                BIT(0)                                              /*!< "disable modification on read" function enable for M_CAN of the first DTM_CAN in a CAN cluster */
#define CAN_DMR_DMORD1                BIT(1)                                              /*!< "disable modification on read" function enable for M_CAN of the second DTM_CAN in a CAN cluster */
#define CAN_DMR_DMORD2                BIT(2)                                              /*!< "disable modification on read" function enable for M_CAN of the third DTM_CAN in a CAN cluster */

/* CAN_CSR */
#define CAN_CSR_CSR0                  BIT(0)                                              /*!< clock stop request signal for M_CAN of the first DTM_CAN in a CAN cluster */
#define CAN_CSR_CSR1                  BIT(1)                                              /*!< clock stop request signal for M_CAN of the second DTM_CAN in a CAN cluster */
#define CAN_CSR_CSR2                  BIT(2)                                              /*!< clock stop request signal for M_CAN of the third DTM_CAN in a CAN cluster */

/* CAN_CSA */
#define CAN_CSA_CSA0                  BIT(0)                                              /*!< clock stop acknowledge for M_CAN of the first DTM_CAN in a CAN cluster */
#define CAN_CSA_CSA1                  BIT(1)                                              /*!< clock stop acknowledge for M_CAN of the second DTM_CAN in a CAN cluster */
#define CAN_CSA_CSA2                  BIT(2)                                              /*!< clock stop acknowledge for M_CAN of the third DTM_CAN in a CAN cluster */

/* CAN_CTL */
#define CAN_CTL_DMAEN0                BIT(12)                                             /*!< DMA request enable for M_CAN of the first DTM_CAN in a CAN cluster */
#define CAN_CTL_DMAEN1                BIT(13)                                             /*!< DMA request enable for M_CAN of the second DTM_CAN in a CAN cluster */
#define CAN_CTL_DMAEN2                BIT(14)                                             /*!< DMA request enable for M_CAN of the third DTM_CAN in a CAN cluster */
#define CAN_CTL_ECRWEN                BIT(29)                                             /*!< CAN_MERRCTL register write access enable */

/* CAN_MERRCTL */
#define CAN_MERRCTL_ECCEN             BIT(8)                                              /*!< enable ECC */
#define CAN_MERRCTL_CEIE              BIT(16)                                             /*!< correctable error interrupt enable */
#define CAN_MERRCTL_NCEIE             BIT(17)                                             /*!< noncorrectable error interrupt enable */
#define CAN_MERRCTL_RWDIS             BIT(31)                                             /*!< CAN_MERRCTL register write access disable */

/* CAN_CERRRx(x=0..3) */
#define CAN_CERRR_CERA                BITS(0,10)                                          /*!< correctable error record address */
#define CAN_CERRR_CERS                BIT(24)                                             /*!< correctable error record status */

/* CAN_NCERRR */
#define CAN_NCERRR_NCERA              BITS(0,10)                                          /*!< noncorrectable error record address */
#define CAN_NCERRR_NCERS              BIT(24)                                             /*!< noncorrectable error record status */

/* CAN_MERRSTAT */
#define CAN_MERRSTAT_NCE_EAEF         BIT(24)                                             /*!< noncorrectable EDC after ECC error flag */
#define CAN_MERRSTAT_NCE_AEDCF        BIT(25)                                             /*!< noncorrectable address EDC error flag */
#define CAN_MERRSTAT_NCDEF            BIT(26)                                             /*!< noncorrectable double bit error flag */
#define CAN_MERRSTAT_BUFOVF           BIT(27)                                             /*!< correctable error record buffer overflow flag */
#define CAN_MERRSTAT_CEOVF            BIT(28)                                             /*!< correctable error overflow flag */
#define CAN_MERRSTAT_NCEOVF           BIT(29)                                             /*!< noncorrectable error overflow flag */
#define CAN_MERRSTAT_CEF              BIT(30)                                             /*!< correctable error flag */

/* CAN_M_CAN_CREL */
#define CAN_M_CAN_CREL_DAY            BITS(0,7)                                           /*!< timestamp day */
#define CAN_M_CAN_CREL_MON            BITS(8,15)                                          /*!< timestamp month */
#define CAN_M_CAN_CREL_YEAR           BITS(16,19)                                         /*!< timestamp year */
#define CAN_M_CAN_CREL_SUBSTEP        BITS(20,23)                                         /*!< sub-step of Core Release */
#define CAN_M_CAN_CREL_STEP           BITS(24,27)                                         /*!< step of Core Release */
#define CAN_M_CAN_CREL_REL            BITS(28,31)                                         /*!< core release */

/* CAN_M_CAN_ENDN */
#define CAN_M_CAN_ENDN_ETV            BITS(0,31)                                          /*!< endianness test value */

/* CAN_M_CAN_DBTP */
#define CAN_M_CAN_DBTP_DSJW           BITS(0,3)                                           /*!< data resynchronization jump width */
#define CAN_M_CAN_DBTP_DTSEG2         BITS(4,7)                                           /*!< data time segment 2 */
#define CAN_M_CAN_DBTP_DTSEG1         BITS(8,12)                                          /*!< data time segment 1 */
#define CAN_M_CAN_DBTP_DBRP           BITS(16,20)                                         /*!< data bit rate prescaler */
#define CAN_M_CAN_DBTP_TDC            BIT(23)                                             /*!< transmitter delay compensation */

