sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_M_CAN_TEST */
#define CAN_M_CAN_TEST_LBCK           BIT(4)                                              /*!< loop back mode */
#define CAN_M_CAN_TEST_TX             BITS(5,6)                                           /*!< control of TX pin */
#define CAN_M_CAN_TEST_RX             BIT(7)                                              /*!< receive pin */
#define CAN_M_CAN_TEST_TXBNP          BITS(8,12)                                          /*!< Tx buffer number prepared */
#define CAN_M_CAN_TEST_PVAL           BIT(13)                                             /*!< prepared valid */
#define CAN_M_CAN_TEST_TXBNS          BITS(16,20)                                         /*!< Tx buffer number started */
#define CAN_M_CAN_TEST_SVAL           BIT(21)                                             /*!< started valid */

/* CAN_M_CAN_RWD */
#define CAN_M_CAN_RWD_WDC             BITS(0,7)                                           /*!< watchdog configuration */
#define CAN_M_CAN_RWD_WDV             BITS(8,15)                                          /*!< watchdog value */

/* CAN_M_CAN_CCCR */
#define CAN_M_CAN_CCCR_INIT           BIT(0)                                              /*!< initialization */
#define CAN_M_CAN_CCCR_CCE            BIT(1)                                              /*!< configuration change enable */
#define CAN_M_CAN_CCCR_ASM            BIT(2)                                              /*!< restricted operation mode */
#define CAN_M_CAN_CCCR_CSA            BIT(3)                                              /*!< clock stop acknowledge */
#define CAN_M_CAN_CCCR_CSR            BIT(4)                                              /*!< clock stop request */
#define CAN_M_CAN_CCCR_MON            BIT(5)                                              /*!< bus monitoring mode */
#define CAN_M_CAN_CCCR_DAR            BIT(6)                                              /*!< disable automatic retransmission */
#define CAN_M_CAN_CCCR_TEST           BIT(7)                                              /*!< test mode enable */
#define CAN_M_CAN_CCCR_FDOE           BIT(8)                                              /*!< FD operation enable */
#define CAN_M_CAN_CCCR_BRSE           BIT(9)                                              /*!< bit rate switch enable */
#define CAN_M_CAN_CCCR_WMM            BIT(11)                                             /*!< wide message marker */
#define CAN_M_CAN_CCCR_PXHD           BIT(12)                                             /*!< protocol exception handling disable */
#define CAN_M_CAN_CCCR_EFBI           BIT(13)                                             /*!< edge filtering during bus integration */
#define CAN_M_CAN_CCCR_TXP            BIT(14)                                             /*!< transmit pause */
#define CAN_M_CAN_CCCR_NISO           BIT(15)                                             /*!< non ISO operation */

/* CAN_M_CAN_NBTP */
#define CAN_M_CAN_NBTP_NTSEG2         BITS(0,6)                                           /*!< nominal time segment 2 */
#define CAN_M_CAN_NBTP_NTSEG1         BITS(8,15)                                          /*!< nominal time segment 1 */
#define CAN_M_CAN_NBTP_NBRP           BITS(16,24)                                         /*!< nominal bit rate prescaler */
#define CAN_M_CAN_NBTP_NSJW           BITS(25,31)                                         /*!< nominal (re)synchronization jump width */

/* CAN_M_CAN_TSCC */
#define CAN_M_CAN_TSCC_TSS            BITS(0,1)                                           /*!< timestamp select */
#define CAN_M_CAN_TSCC_TCP            BITS(16,19)                                         /*!< timestamp counter prescaler */

/* CAN_M_CAN_TSCV */
#define CAN_M_CAN_TSCV_TSC            BITS(0,15)                                          /*!< timestamp counter */

/* CAN_M_CAN_TOCC */
#define CAN_M_CAN_TOCC_ETOC           BIT(0)                                              /*!< enable timeout counter */
#define CAN_M_CAN_TOCC_TOS            BITS(1,2)                                           /*!< timeout select */
#define CAN_M_CAN_TOCC_TOP            BITS(16,31)                                         /*!< timeout period */

/* CAN_M_CAN_TOCV */
#define CAN_M_CAN_TOCV_TOC            BITS(0,15)                                          /*!< timeout counter */

/* CAN_M_CAN_ECR */
#define CAN_M_CAN_ECR_TEC             BITS(0,7)                                           /*!< transmit error counter */
#define CAN_M_CAN_ECR_REC             BITS(8,14)                                          /*!< receive error counter */
#define CAN_M_CAN_ECR_RP              BIT(15)                                             /*!< receive error passive */
#define CAN_M_CAN_ECR_CEL             BITS(16,23)                                         /*!< CAN error logging */

/* CAN_M_CAN_PSR */
#define CAN_M_CAN_PSR_LEC             BITS(0,2)                                           /*!< last error code */
#define CAN_M_CAN_PSR_ACT             BITS(3,4)                                           /*!< activity */
#define CAN_M_CAN_PSR_EP              BIT(5)                                              /*!< error passive */
#define CAN_M_CAN_PSR_EW              BIT(6)                                              /*!< warning status */
#define CAN_M_CAN_PSR_BO              BIT(7)                                              /*!< bus_off status */
#define CAN_M_CAN_PSR_DLEC            BITS(8,10)                                          /*!< data last error code */
#define CAN_M_CAN_PSR_RESI            BIT(11)                                             /*!< ESI flag of received CAN FD message */
#define CAN_M_CAN_PSR_RBRS            BIT(12)                                             /*!< BRS flag of received CAN FD message */
#define CAN_M_CAN_PSR_RFDF            BIT(13)                                             /*!< receive an FD message */
#define CAN_M_CAN_PSR_PXE             BIT(14)                                             /*!< protocol exception event */
#define CAN_M_CAN_PSR_TDCV            BITS(16,22)                                         /*!< transmitter delay compensation value */

/* CAN_M_CAN_TDCR */
#define CAN_M_CAN_TDCR_TDCF           BITS(0,6)                                           /*!< transmitter delay compensation filter window length */
#define CAN_M_CAN_TDCR_TDCO           BITS(8,14)                                          /*!< transmitter delay compensation offset */

