sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_M_CAN_IR */
#define CAN_M_CAN_IR_RF0N             BIT(0)                                              /*!< Rx FIFO 0 new message */
#define CAN_M_CAN_IR_RF0W             BIT(1)                                              /*!< Rx FIFO 0 watermark reached */
#define CAN_M_CAN_IR_RF0F             BIT(2)                                              /*!< Rx FIFO 0 full */
#define CAN_M_CAN_IR_RF0L             BIT(3)                                              /*!< Rx FIFO 0 message lost */
#define CAN_M_CAN_IR_RF1N             BIT(4)                                              /*!< Rx FIFO 1 new message */
#define CAN_M_CAN_IR_RF1W             BIT(5)                                              /*!< Rx FIFO 1 watermark reached */
#define CAN_M_CAN_IR_RF1F             BIT(6)                                              /*!< Rx FIFO 1 full */
#define CAN_M_CAN_IR_RF1L             BIT(7)                                              /*!< Rx FIFO 1 message lost */
#define CAN_M_CAN_IR_HPM              BIT(8)                                              /*!< high priority message */
#define CAN_M_CAN_IR_TC               BIT(9)                                              /*!< transmission completed */
#define CAN_M_CAN_IR_TCF              BIT(10)                                             /*!< transmission cancellation finished */
#define CAN_M_CAN_IR_TFE              BIT(11)                                             /*!< Tx FIFO empty */
#define CAN_M_CAN_IR_TEFN             BIT(12)                                             /*!< Tx event FIFO new entry */
#define CAN_M_CAN_IR_TEFW             BIT(13)                                             /*!< Tx event FIFO watermark reached */
#define CAN_M_CAN_IR_TEFF             BIT(14)                                             /*!< Tx event FIFO full */
#define CAN_M_CAN_IR_TEFL             BIT(15)                                             /*!< Tx event FIFO element lost */
#define CAN_M_CAN_IR_TSW              BIT(16)                                             /*!< timestamp wrapped around */
#define CAN_M_CAN_IR_MRAF             BIT(17)                                             /*!< message RAM access failure */
#define CAN_M_CAN_IR_TOO              BIT(18)                                             /*!< timeout occurred */
#define CAN_M_CAN_IR_DRX              BIT(19)                                             /*!< message stored to dedicated Rx buffer */
#define CAN_M_CAN_IR_ELO              BIT(22)                                             /*!< error logging overflow */
#define CAN_M_CAN_IR_EP               BIT(23)                                             /*!< error passive */
#define CAN_M_CAN_IR_EW               BIT(24)                                             /*!< warning status */
#define CAN_M_CAN_IR_BO               BIT(25)                                             /*!< bus_off status */
#define CAN_M_CAN_IR_WDI              BIT(26)                                             /*!< watchdog interrupt */
#define CAN_M_CAN_IR_PEA              BIT(27)                                             /*!< protocol error in arbitration phase */
#define CAN_M_CAN_IR_PED              BIT(28)                                             /*!< protocol error in data phase */

/* CAN_M_CAN_IE */
#define CAN_M_CAN_IE_RF0NE            BIT(0)                                              /*!< Rx FIFO 0 new message interrupt enable */
#define CAN_M_CAN_IE_RF0WE            BIT(1)                                              /*!< Rx FIFO 0 watermark reached interrupt enable */
#define CAN_M_CAN_IE_RF0FE            BIT(2)                                              /*!< Rx FIFO 0 full interrupt enable */
#define CAN_M_CAN_IE_RF0LE            BIT(3)                                              /*!< Rx FIFO 0 message lost interrupt enable */
#define CAN_M_CAN_IE_RF1NE            BIT(4)                                              /*!< Rx FIFO 1 new message interrupt enable */
#define CAN_M_CAN_IE_RF1WE            BIT(5)                                              /*!< Rx FIFO 1 watermark reached interrupt enable */
#define CAN_M_CAN_IE_RF1FE            BIT(6)                                              /*!< Rx FIFO 1 full interrupt enable */
#define CAN_M_CAN_IE_RF1LE            BIT(7)                                              /*!< Rx FIFO 1 message lost interrupt enable */
#define CAN_M_CAN_IE_HPME             BIT(8)                                              /*!< high priority message interrupt enable */
#define CAN_M_CAN_IE_TCE              BIT(9)                                              /*!< transmission completed interrupt enable */
#define CAN_M_CAN_IE_TCFE             BIT(10)                                             /*!< transmission cancellation finished interrupt enable */
#define CAN_M_CAN_IE_TFEE             BIT(11)                                             /*!< Tx FIFO empty interrupt enable */
#define CAN_M_CAN_IE_TEFNE            BIT(12)                                             /*!< Tx event FIFO new entry interrupt enable */
#define CAN_M_CAN_IE_TEFWE            BIT(13)                                             /*!< Tx event FIFO watermark reached interrupt enable */
#define CAN_M_CAN_IE_TEFFE            BIT(14)                                             /*!< Tx event FIFO full interrupt enable */
#define CAN_M_CAN_IE_TEFLE            BIT(15)                                             /*!< Tx event FIFO element lost interrupt enable */
#define CAN_M_CAN_IE_TSWE             BIT(16)                                             /*!< timestamp wrapped around interrupt enable */
#define CAN_M_CAN_IE_MRAFE            BIT(17)                                             /*!< message RAM access failure interrupt enable */
#define CAN_M_CAN_IE_TOOE             BIT(18)                                             /*!< timeout occurred interrupt enable */
#define CAN_M_CAN_IE_DRXE             BIT(19)                                             /*!< message stored to dedicated Rx buffer interrupt enable */
#define CAN_M_CAN_IE_ELOE             BIT(22)                                             /*!< error logging overflow interrupt enable */
#define CAN_M_CAN_IE_EPE              BIT(23)                                             /*!< error passive interrupt enable */
#define CAN_M_CAN_IE_EWE              BIT(24)                                             /*!< warning status interrupt enable */
#define CAN_M_CAN_IE_BOE              BIT(25)                                             /*!< bus_off status interrupt enable */
#define CAN_M_CAN_IE_WDIE             BIT(26)                                             /*!< watchdog interrupt enable */
#define CAN_M_CAN_IE_PEAE             BIT(27)                                             /*!< protocol error in arbitration phase interrupt enable */
#define CAN_M_CAN_IE_PEDE             BIT(28)                                             /*!< protocol error in data phase interrupt enable */

/* CAN_M_CAN_ILS */
#define CAN_M_CAN_ILS_RF0NL           BIT(0)                                              /*!< Rx FIFO 0 new message interrupt line */
#define CAN_M_CAN_ILS_RF0WL           BIT(1)                                              /*!< Rx FIFO 0 watermark reached interrupt line */
#define CAN_M_CAN_ILS_RF0FL           BIT(2)                                              /*!< Rx FIFO 0 full interrupt line */
#define CAN_M_CAN_ILS_RF0LL           BIT(3)                                              /*!< Rx FIFO 0 message lost interrupt line */
#define CAN_M_CAN_ILS_RF1NL           BIT(4)                                              /*!< Rx FIFO 1 new message interrupt line */
#define CAN_M_CAN_ILS_RF1WL           BIT(5)                                              /*!< Rx FIFO 1 watermark reached interrupt line */
#define CAN_M_CAN_ILS_RF1FL           BIT(6)                                              /*!< Rx FIFO 1 full interrupt line */
#define CAN_M_CAN_ILS_RF1LL           BIT(7)                                              /*!< Rx FIFO 1 message lost interrupt line */
#define CAN_M_CAN_ILS_HPML            BIT(8)                                              /*!< high priority message interrupt line */
#define CAN_M_CAN_ILS_TCL             BIT(9)                                              /*!< transmission completed interrupt line */
#define CAN_M_CAN_ILS_TCFL            BIT(10)                                             /*!< transmission cancellation finished interrupt line */
#define CAN_M_CAN_ILS_TFEL            BIT(11)                                             /*!< Tx FIFO empty interrupt line */
#define CAN_M_CAN_ILS_TEFNL           BIT(12)                                             /*!< Tx event FIFO new entry interrupt line */
#define CAN_M_CAN_ILS_TEFWL           BIT(13)                                             /*!< Tx event FIFO watermark reached interrupt line */
#define CAN_M_CAN_ILS_TEFFL           BIT(14)                                             /*!< Tx event FIFO full interrupt line */
#define CAN_M_CAN_ILS_TEFLL           BIT(15)                                             /*!< Tx event FIFO element lost interrupt line */
#define CAN_M_CAN_ILS_TSWL            BIT(16)                                             /*!< timestamp wrapped around interrupt line */
#define CAN_M_CAN_ILS_MRAFL           BIT(17)                                             /*!< message RAM access failure interrupt line */
#define CAN_M_CAN_ILS_TOOL            BIT(18)                                             /*!< timeout occurred interrupt line */
#define CAN_M_CAN_ILS_DRXL            BIT(19)                                             /*!< message stored to dedicated Rx buffer interrupt line */
#define CAN_M_CAN_ILS_ELOL            BIT(22)                                             /*!< error logging overflow interrupt line */
#define CAN_M_CAN_ILS_EPL             BIT(23)                                             /*!< error passive interrupt line */
#define CAN_M_CAN_ILS_EWL             BIT(24)                                             /*!< warning status interrupt line */
#define CAN_M_CAN_ILS_BOL             BIT(25)                                             /*!< bus_off status interrupt line */
#define CAN_M_CAN_ILS_WDIL            BIT(26)                                             /*!< watchdog interrupt line */
#define CAN_M_CAN_ILS_PEAL            BIT(27)                                             /*!< protocol error in arbitration phase interrupt line */
#define CAN_M_CAN_ILS_PEDL            BIT(28)                                             /*!< protocol error in data phase interrupt line */

