sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_M_CAN_ILE */
#define CAN_M_CAN_ILE_EINT0           BIT(0)                                              /*!< enable interrupt line 0 */
#define CAN_M_CAN_ILE_EINT1           BIT(1)                                              /*!< enable interrupt line 1 */

/* CAN_M_CAN_GFC */
#define CAN_M_CAN_GFC_RRFE            BIT(0)                                              /*!< reject remote frames extended */
#define CAN_M_CAN_GFC_RRFS            BIT(1)                                              /*!< reject remote frames standard */
#define CAN_M_CAN_GFC_ANFE            BITS(2,3)                                           /*!< accept non-matching frames extended */
#define CAN_M_CAN_GFC_ANFS            BITS(4,5)                                           /*!< accept non-matching frames standard */

/* CAN_M_CAN_SIDFC */
#define CAN_M_CAN_SIDFC_FLSSA         BITS(2,15)                                          /*!< filter list standard start address */
#define CAN_M_CAN_SIDFC_LSS           BITS(16,23)                                         /*!< list size standard */

/* CAN_M_CAN_XIDFC */
#define CAN_M_CAN_XIDFC_FLESA         BITS(2,15)                                          /*!< filter list extended start address */
#define CAN_M_CAN_XIDFC_LSE           BITS(16,22)                                         /*!< list size extended */

/* CAN_M_CAN_XIDAM */
#define CAN_M_CAN_XIDAM_EIDM          BITS(0,28)                                          /*!< extended ID mask */

/* CAN_M_CAN_HPMS */
#define CAN_M_CAN_HPMS_BIDX           BITS(0,5)                                           /*!< buffer index */
#define CAN_M_CAN_HPMS_MSI            BITS(6,7)                                           /*!< message storage indicator */
#define CAN_M_CAN_HPMS_FIDX           BITS(8,14)                                          /*!< filter index */
#define CAN_M_CAN_HPMS_FLST           BIT(15)                                             /*!< filter list */

/* CAN_M_CAN_NDAT1 */
#define CAN_M_CAN_NDAT1_ND(x)         BIT(x)                                              /*!< new data flag Rx buffer 0~31 */

/* CAN_M_CAN_NDAT2 */
#define CAN_M_CAN_NDAT2_ND(x)         BIT(x)                                              /*!< new data flag Rx buffer 32~63 */

/* CAN_M_CAN_RXF0C / CAN_M_CAN_RXF1C */
#define CAN_M_CAN_RXFXC_FSA           BITS(2,15)                                          /*!< Rx FIFO start address */
#define CAN_M_CAN_RXFXC_FS            BITS(16,22)                                         /*!< Rx FIFO size */
#define CAN_M_CAN_RXFXC_FWM           BITS(24,30)                                         /*!< Rx FIFO watermark */
#define CAN_M_CAN_RXFXC_FOM           BIT(31)                                             /*!< FIFO operation mode */

/* CAN_M_CAN_RXF0S / CAN_M_CAN_RXF1S */
#define CAN_M_CAN_RXFXS_FFL           BITS(0,6)                                           /*!< Rx FIFO fill level */
#define CAN_M_CAN_RXFXS_FGI           BITS(8,13)                                          /*!< Rx FIFO get index */
#define CAN_M_CAN_RXFXS_FPI           BITS(16,21)                                         /*!< Rx FIFO put index */
#define CAN_M_CAN_RXFXS_FF            BIT(24)                                             /*!< Rx FIFO full */
#define CAN_M_CAN_RXFXS_RFL           BIT(25)                                             /*!< Rx FIFO message lost */

/* CAN_M_CAN_RXF0A / CAN_M_CAN_RXF1A */
#define CAN_M_CAN_RXFXA_FAI           BITS(0,5)                                           /*!< Rx FIFO acknowledge index */

/* CAN_M_CAN_RXBC */
#define CAN_M_CAN_RXBC_RBSA           BITS(2,15)                                          /*!< Rx buffer start address */

/* CAN_M_CAN_RXESC */
#define CAN_M_CAN_RXESC_F0DS          BITS(0,2)                                           /*!< Rx FIFO 0 data field size */
#define CAN_M_CAN_RXESC_F1DS          BITS(4,6)                                           /*!< Rx FIFO 1 data field size */
#define CAN_M_CAN_RXESC_RBDS          BITS(8,10)                                          /*!< Rx buffer data field size */

/* CAN_M_CAN_TXBC */
#define CAN_M_CAN_TXBC_TBSA           BITS(2,15)                                          /*!< Tx buffer start address */
#define CAN_M_CAN_TXBC_NDTB           BITS(16,21)                                         /*!< number of dedicated transmit buffers */
#define CAN_M_CAN_TXBC_TFQS           BITS(24,29)                                         /*!< Tx FIFO/Queue size */
#define CAN_M_CAN_TXBC_TFQM           BIT(30)                                             /*!< Tx FIFO/Queue mode */

/* CAN_M_CAN_TXFQS */
#define CAN_M_CAN_TXFQS_TFFL          BITS(0,5)                                           /*!< Tx FIFO free level */
#define CAN_M_CAN_TXFQS_TFGI          BITS(8,12)                                          /*!< Tx FIFO get index */
#define CAN_M_CAN_TXFQS_TFQPI         BITS(16,20)                                         /*!< Tx FIFO/Queue put index */
#define CAN_M_CAN_TXFQS_TFQF          BIT(21)                                             /*!< Tx FIFO/Queue full */

/* CAN_M_CAN_TXESC */
#define CAN_M_CAN_TXESC_TBDS          BITS(0,2)                                           /*!< Tx buffer data field size */

/* CAN_M_CAN_TXBRP */
#define CAN_M_CAN_TXBRP_TRP(x)        BIT(x)                                              /*!< transmission request pending x */

/* CAN_M_CAN_TXBAR */
#define CAN_M_CAN_TXBAR_AR(x)         BIT(x)                                              /*!< add request x */

/* CAN_M_CAN_TXBCR */
#define CAN_M_CAN_TXBCR_CR(x)         BIT(x)                                              /*!< cancellation request x */

/* CAN_M_CAN_TXBTO */
#define CAN_M_CAN_TXBTO_TO(x)         BIT(x)                                              /*!< transmission occurred x */

/* CAN_M_CAN_TXBCF */
#define CAN_M_CAN_TXBCF_CF(x)         BIT(x)                                              /*!< cancellation finished x */

/* CAN_M_CAN_TXBTIE */
#define CAN_M_CAN_TXBTIE_TIE(x)       BIT(x)                                              /*!< transmission interrupt enable x */

/* CAN_M_CAN_TXBCIE */
#define CAN_M_CAN_TXBCIE_CFIE(x)      BIT(x)                                              /*!< cancellation finished interrupt enable x */

/* CAN_M_CAN_TXEFC */
#define CAN_M_CAN_TXEFC_EFSA          BITS(2,15)                                          /*!< event FIFO start address */
#define CAN_M_CAN_TXEFC_EFS           BITS(16,21)                                         /*!< event FIFO size */
#define CAN_M_CAN_TXEFC_EFWM          BITS(24,29)                                         /*!< event FIFO watermark */

/* CAN_M_CAN_TXEFS */
#define CAN_M_CAN_TXEFS_EFFL          BITS(0,5)                                           /*!< event FIFO fill level */
#define CAN_M_CAN_TXEFS_EFGI          BITS(8,12)                                          /*!< event FIFO get index */
#define CAN_M_CAN_TXEFS_EFPI          BITS(16,20)                                         /*!< event FIFO put index */
#define CAN_M_CAN_TXEFS_EFF           BIT(24)                                             /*!< event FIFO full */
#define CAN_M_CAN_TXEFS_TEFL          BIT(25)                                             /*!< Tx event FIFO element lost */

/* CAN_M_CAN_TXEFA */
#define CAN_M_CAN_TXEFA_EFAI          BITS(0,4)                                           /*!< event FIFO acknowledge index */

/* CAN_DMU_DMUCR */
#define CAN_DMU_DMUCR_DAY             BITS(0,7)                                           /*!< time stamp day (two digit, BCD-coded) */
#define CAN_DMU_DMUCR_MON             BITS(8,15)                                          /*!< time stamp month (two digit, BCD-coded) */
#define CAN_DMU_DMUCR_YEAR            BITS(16,19)                                         /*!< time stamp year (one digit, BCD-coded) */
#define CAN_DMU_DMUCR_SUBSTEP         BITS(20,23)                                         /*!< sub-step of core release (one digit, BCD-coded) */
#define CAN_DMU_DMUCR_STEP            BITS(24,27)                                         /*!< step of core release (one digit, BCD-coded) */
#define CAN_DMU_DMUCR_REL             BITS(28,31)                                         /*!< core release (one digit, BCD-coded) */

/* CAN_DMU_DMUI */
#define CAN_DMU_DMUI_TXR              BIT(0)                                              /*!< TX service request line of DMU */
#define CAN_DMU_DMUI_RX0R             BIT(1)                                              /*!< RX0 service request line of DMU */
#define CAN_DMU_DMUI_RX1R             BIT(2)                                              /*!< RX1 service request line of DMU */
#define CAN_DMU_DMUI_TXER             BIT(3)                                              /*!< TX event service request line of DMU */
#define CAN_DMU_DMUI_TFQPIP           BITS(8,12)                                          /*!< TX FIFO/Queue put index previous */
#define CAN_DMU_DMUI_ENA              BIT(15)                                             /*!< DMU is enabled */
#define CAN_DMU_DMUI_EHS              BITS(24,26)                                         /*!< element handler state */
#define CAN_DMU_DMUI_TX               BIT(28)                                             /*!< TX DMU element service */
#define CAN_DMU_DMUI_RX0              BIT(29)                                             /*!< RX0 DMU element service */
#define CAN_DMU_DMUI_RX1              BIT(30)                                             /*!< RX1 DMU element service */
#define CAN_DMU_DMUI_TXE              BIT(31)                                             /*!< TX event DMU element service */

/* CAN_DMU_DMUQC */
#define CAN_DMU_DMUQC_TXEEC           BITS(0,7)                                           /*!< TX element enqueueing counter */
#define CAN_DMU_DMUQC_RX0EDC          BITS(8,15)                                          /*!< RX0 element dequeueing counter */
#define CAN_DMU_DMUQC_RX1EDC          BITS(16,23)                                         /*!< RX1 element dequeueing counter */
#define CAN_DMU_DMUQC_TXEEDC          BITS(24,31)                                         /*!< TX event element dequeueing counter */

/* CAN_DMU_DMUIR */
#define CAN_DMU_DMUIR_TXENSA          BIT(0)                                              /*!< TX element not start address */
#define CAN_DMU_DMUIR_TXEIE           BIT(1)                                              /*!< TX element illegal enqueueing */
#define CAN_DMU_DMUIR_TXEIAS          BIT(2)                                              /*!< TX element illegal access sequence */
#define CAN_DMU_DMUIR_TXEIDLC         BIT(3)                                              /*!< TX element illegal DLC */
#define CAN_DMU_DMUIR_TXEWATA         BIT(4)                                              /*!< TX element write after trigger address */
#define CAN_DMU_DMUIR_TXEIR           BIT(5)                                              /*!< TX element illegal read */
#define CAN_DMU_DMUIR_TXEE            BIT(6)                                              /*!< TX element enqueued */
#define CAN_DMU_DMUIR_RX0ENSA         BIT(8)                                              /*!< RX0 element not start address */
#define CAN_DMU_DMUIR_RX0EID          BIT(9)                                              /*!< RX0 element illegal dequeueing */
#define CAN_DMU_DMUIR_RX0EIAS         BIT(10)                                             /*!< RX0 element illegal access sequence */
#define CAN_DMU_DMUIR_RX0EIW          BIT(11)                                             /*!< RX0 element illegal write */
#define CAN_DMU_DMUIR_RX0ED           BIT(12)                                             /*!< RX0 element dequeued */
#define CAN_DMU_DMUIR_RX1ENSA         BIT(16)                                             /*!< RX1 element not start address */
#define CAN_DMU_DMUIR_RX1EID          BIT(17)                                             /*!< RX1 element illegal dequeueing */
#define CAN_DMU_DMUIR_RX1EIAS         BIT(18)                                             /*!< RX1 element illegal access sequence */
#define CAN_DMU_DMUIR_RX1EIW          BIT(19)                                             /*!< RX1 element illegal write */
#define CAN_DMU_DMUIR_RX1ED           BIT(20)                                             /*!< RX1 element dequeued */
#define CAN_DMU_DMUIR_TXEENSA         BIT(24)                                             /*!< TX event element not start address */
#define CAN_DMU_DMUIR_TXEEID          BIT(25)                                             /*!< TX event element illegal dequeueing */
#define CAN_DMU_DMUIR_TXEEIAS         BIT(26)                                             /*!< TX event element illegal access sequence */
#define CAN_DMU_DMUIR_TXEEIW          BIT(27)                                             /*!< TX event element illegal write */
#define CAN_DMU_DMUIR_TXEED           BIT(28)                                             /*!< TX event element dequeued */
#define CAN_DMU_DMUIR_IAC             BIT(30)                                             /*!< illegal access while in configuration mode */

