sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_DMU_DMUIE */
#define CAN_DMU_DMUIE_TXENSAE         BIT(0)                                              /*!< TX element not start address enable */
#define CAN_DMU_DMUIE_TXEIEE          BIT(1)                                              /*!< TX element illegal enqueueing enable */
#define CAN_DMU_DMUIE_TXEIASE         BIT(2)                                              /*!< TX element illegal access sequence enable */
#define CAN_DMU_DMUIE_TXEIDLCE        BIT(3)                                              /*!< TX element illegal DLC enable */
#define CAN_DMU_DMUIE_TXEWATAE        BIT(4)                                              /*!< TX element write after trigger address enable */
#define CAN_DMU_DMUIE_TXEIRE          BIT(5)                                              /*!< TX element illegal read enable */
#define CAN_DMU_DMUIE_TXEEE           BIT(6)                                              /*!< TX element enqueued enable */
#define CAN_DMU_DMUIE_RX0ENSAE        BIT(8)                                              /*!< RX0 element not start address enable */
#define CAN_DMU_DMUIE_RX0EIDE         BIT(9)                                              /*!< RX0 element illegal dequeueing enable */
#define CAN_DMU_DMUIE_RX0EIASE        BIT(10)                                             /*!< RX0 element illegal access sequence enable */
#define CAN_DMU_DMUIE_RX0EIWE         BIT(11)                                             /*!< RX0 element illegal write enable */
#define CAN_DMU_DMUIE_RX0EDE          BIT(12)                                             /*!< RX0 element dequeued enable */
#define CAN_DMU_DMUIE_RX1ENSAE        BIT(16)                                             /*!< RX1 element not start address enable */
#define CAN_DMU_DMUIE_RX1EIDE         BIT(17)                                             /*!< RX1 element illegal dequeueing enable */
#define CAN_DMU_DMUIE_RX1EIASE        BIT(18)                                             /*!< RX1 element illegal access sequence enable */
#define CAN_DMU_DMUIE_RX1EIWE         BIT(19)                                             /*!< RX1 element illegal write enable */
#define CAN_DMU_DMUIE_RX1EDE          BIT(20)                                             /*!< RX1 element dequeued enable */
#define CAN_DMU_DMUIE_TXEENSAE        BIT(24)                                             /*!< TX event element not start address enable */
#define CAN_DMU_DMUIE_TXEEIDE         BIT(25)                                             /*!< TX event element illegal dequeueing enable */
#define CAN_DMU_DMUIE_TXEEIASE        BIT(26)                                             /*!< TX event element illegal access sequence enable */
#define CAN_DMU_DMUIE_TXEEIWE         BIT(27)                                             /*!< TX event element illegal write enable */
#define CAN_DMU_DMUIE_TXEEDE          BIT(28)                                             /*!< TX event element dequeued enable */
#define CAN_DMU_DMUIE_IACE            BIT(30)                                             /*!< illegal access while in configuration mode enable */

/* CAN_DMU_DMUC */
#define CAN_DMU_DMUC_TTS              BIT(0)                                              /*!< transfer timestamp */

/* CAN_R0 */
#define CAN_R0_ID                     BITS(0,28)                                          /*!< identifier */
#define CAN_R0_RTR                    BIT(29)                                             /*!< remote transmission request */
#define CAN_R0_XTD                    BIT(30)                                             /*!< extended identifier */
#define CAN_R0_ESI                    BIT(31)                                             /*!< error state indicator */

/* CAN_R1A */
#define CAN_R1A_RXTS                  BITS(0,15)                                          /*!< identifier */
#define CAN_R1A_DLC                   BITS(16,19)                                         /*!< data length code */
#define CAN_R1A_BRS                   BIT(20)                                             /*!< bit rate switch */
#define CAN_R1A_FDF                   BIT(21)                                             /*!< FD format */
#define CAN_R1A_FIDX                  BITS(24,30)                                         /*!< filter index */
#define CAN_R1A_ANMF                  BIT(31)                                             /*!< accepted non-matching frame */

/* CAN_T0 */
#define CAN_T0_ID                     BITS(0,28)                                          /*!< identifier */
#define CAN_T0_RTR                    BIT(29)                                             /*!< remote transmission request */
#define CAN_T0_XTD                    BIT(30)                                             /*!< extended identifier */
#define CAN_T0_ESI                    BIT(31)                                             /*!< error state indicator */

/* CAN_T1 */
#define CAN_T1_MM_HIGH                BITS(8,15)                                          /*!< message marker high byte */
#define CAN_T1_DLC                    BITS(16,19)                                         /*!< data length code */
#define CAN_T1_BRS                    BIT(20)                                             /*!< bit rate switch */
#define CAN_T1_FDF                    BIT(21)                                             /*!< FD format */
#define CAN_T1_EFC                    BIT(23)                                             /*!< event FIFO control */
#define CAN_T1_MM_LOW                 BITS(24,31)                                         /*!< message marker low byte */

/* CAN_T2 */
#define CAN_T2_DB0                    BITS(0,7)                                           /*!< data byte 0 */
#define CAN_T2_DB1                    BITS(8,15)                                          /*!< data byte 1 */
#define CAN_T2_DB2                    BITS(16,23)                                         /*!< data byte 2 */
#define CAN_T2_DB3                    BITS(24,31)                                         /*!< data byte 3 */

/* CAN_T3 */
#define CAN_T3_DB4                    BITS(0,7)                                           /*!< data byte 4 */
#define CAN_T3_DB5                    BITS(8,15)                                          /*!< data byte 5 */
#define CAN_T3_DB6                    BITS(16,23)                                         /*!< data byte 6 */
#define CAN_T3_DB7                    BITS(24,31)                                         /*!< data byte 7 */

/* CAN_E0 */
#define CAN_E0_ID                     BITS(0,28)                                          /*!< identifier */
#define CAN_E0_RTR                    BIT(29)                                             /*!< remote transmission request */
#define CAN_E0_XTD                    BIT(30)                                             /*!< extended identifier */
#define CAN_E0_ESI                    BIT(31)                                             /*!< error state indicator */

/* CAN_E1A */
#define CAN_E1A_TXTS                  BITS(0,15)                                          /*!< TX timestamp */
#define CAN_E1A_DLC                   BITS(16,19)                                         /*!< data length code */
#define CAN_E1A_BRS                   BIT(20)                                             /*!< bit rate switch */
#define CAN_E1A_FDF                   BIT(21)                                             /*!< FD format */
#define CAN_E1A_ET                    BITS(22,23)                                         /*!< event type */
#define CAN_E1A_MM_LOW                BITS(24,31)                                         /*!< message marker low byte */

