sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_E1B */
#define CAN_E1B_MM_HIGH               BITS(8,15)                                          /*!< message marker high byte */
#define CAN_E1B_DLC                   BITS(16,19)                                         /*!< data length code */
#define CAN_E1B_BRS                   BIT(20)                                             /*!< bit rate switch */
#define CAN_E1B_FDF                   BIT(21)                                             /*!< FD format */
#define CAN_E1B_ET                    BITS(22,23)                                         /*!< event type */
#define CAN_E1B_MM_LOW                BITS(24,31)                                         /*!< message marker low byte */

/* CAN_S0 */
#define CAN_S0_SFID2                  BITS(0,10)                                          /*!< standard filter ID 2 */
#define CAN_S0_SFID1                  BITS(16,26)                                         /*!< standard filter ID 1 */
#define CAN_S0_SFEC                   BITS(27,29)                                         /*!< standard filter element configuration */
#define CAN_S0_SFT                    BITS(30,31)                                         /*!< standard filter type */

/* CAN_F0 */
#define CAN_F0_EFID1                  BITS(0,28)                                          /*!< extended filter ID 1 */
#define CAN_F0_EFEC                   BITS(29,31)                                         /*!< extended filter element configuration */

/* CAN_F1 */
#define CAN_F1_EFID2                  BITS(0,28)                                          /*!< extended filter ID 2 */
#define CAN_F1_EFT                    BITS(30,31)                                         /*!< extended filter type */

/* constants definitions */
/* define the CAN bit position and its register index offset */
#define CAN_REGIDX_BIT(regidx, bitpos) (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define CAN_REG_VAL(canx, offset)      (REG32((uint32_t)(canx) + (((uint32_t)(offset) & 0x0000FFFFU)>> 6U)))
#define CAN_BIT_POS(val)               ((uint32_t)(val) & 0x0000001FU)
#define CAN_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U)\
                                                              | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))
#define CAN_REG_VAL2(canx, offset)     (REG32((uint32_t)(canx) + ((uint32_t)(offset) >> 22U)))
#define CAN_BIT_POS2(val)              (((uint32_t)(val) & 0x001F0000U) >> 16U)
#define CAN_CERRR(canx, num)           REG32((canx) + 0x00000084U + (num) * 0x00000004U) /*!< CAN correctable error record x register */

/* register offset */
#define MERRCTL_REG_OFFSET             ((uint32_t)0x00000080U)                            /*!< CAN_MERRCTL register offset */
#define MERRSTAT_REG_OFFSET            ((uint32_t)0x0000009CU)                            /*!< CAN_MERRSTAT register offset */
#define IR_REG_OFFSET                  ((uint32_t)0x00000050U)                            /*!< CAN_M_CAN_IR register offset */
#define IE_REG_OFFSET                  ((uint32_t)0x00000054U)                            /*!< CAN_M_CAN_IE register offset */
#define PSR_REG_OFFSET                 ((uint32_t)0x00000044U)                            /*!< CAN_M_CAN_PSR register offset */
#define TXBTIE_REG_OFFSET              ((uint32_t)0x000000E0U)                            /*!< CAN_M_CAN_TXBTIE register offset */
#define TXBCIE_REG_OFFSET              ((uint32_t)0x000000E4U)                            /*!< CAN_M_CAN_TXBCIE register offset */
#define TXBTO_REG_OFFSET               ((uint32_t)0x000000D8U)                            /*!< CAN_M_CAN_TXBTO register offset */
#define TXBCF_REG_OFFSET               ((uint32_t)0x000000DCU)                            /*!< CAN_M_CAN_TXBCF register offset */
#define DMUIR_REG_OFFSET               ((uint32_t)0x000003CCU)                            /*!< CAN_DMU_DMUIR register offset */
#define DMUIE_REG_OFFSET               ((uint32_t)0x000003D0U)                            /*!< CAN_DMU_DMUIE register offset */

/* enumerations definitions */
/* DTM_CAN base addresses */
typedef enum {
    DTM_CAN0                         = (CAN0 + 0x00002000U),                              /*!< DTM_CAN0 base address */
    DTM_CAN1                         = (CAN0 + 0x00002800U),                              /*!< DTM_CAN1 base address */
    DTM_CAN2                         = (CAN1 + 0x00002000U),                              /*!< DTM_CAN2 base address */
    DTM_CAN3                         = (CAN1 + 0x00002800U),                              /*!< DTM_CAN3 base address */
    DTM_CAN4                         = (CAN1 + 0x00003000U),                              /*!< DTM_CAN4 base address */
    DTM_CAN5                         = (CAN2 + 0x00002000U),                              /*!< DTM_CAN5 base address */
    DTM_CAN6                         = (CAN2 + 0x00002800U),                              /*!< DTM_CAN6 base address */
    DTM_CAN7                         = (CAN2 + 0x00003000U)                               /*!< DTM_CAN7 base address */
} can_dtm_canx_enum;

/* memory error index */
typedef enum {
    CAN_MEM_ERR_CORRECTABLE_0        = 0U,                                                /*!< CAN memory error correctable 0 */
    CAN_MEM_ERR_CORRECTABLE_1        = 1U,                                                /*!< CAN memory error correctable 1 */
    CAN_MEM_ERR_CORRECTABLE_2        = 2U,                                                /*!< CAN memory error correctable 2 */
    CAN_MEM_ERR_CORRECTABLE_3        = 3U,                                                /*!< CAN memory error correctable 3 */
    CAN_MEM_ERR_NONCORRECTABLE       = 4U                                                 /*!< CAN memory error noncorrectable */
} can_memory_error_index_enum;

/* CAN FD operation mode */
typedef enum {
    CAN_CLASSIC_MODE                 = 0U,                                                /*!< classic CAN mode */
    CAN_FD_MODE                      = 1U                                                 /*!< CAN FD mode */
} can_fd_mode_enum;

