sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* M_CAN operation modes */
typedef enum {
    CAN_MODE_NORMAL                  = 0U,                                                /*!< normal operation mode */
    CAN_MODE_INIT                    = 1U,                                                /*!< initialization mode */
    CAN_MODE_SLEEP                   = 2U,                                                /*!< sleep mode */
    CAN_MODE_MONITOR                 = 3U,                                                /*!< bus monitoring mode */
    CAN_MODE_RESTRICTED              = 4U,                                                /*!< restricted operation mode */
    CAN_MODE_TEST                    = 5U,                                                /*!< test mode */
    CAN_MODE_EXTERNAL_LOOPBACK       = 6U,                                                /*!< external loopback mode */
    CAN_MODE_INTERNAL_LOOPBACK       = 7U                                                 /*!< internal loopback mode */
} can_operating_mode_enum;

/* frame / filter format */
typedef enum {
    CAN_FF_STANDARD                  = 0U,                                                /*!< standard format frame / filter */
    CAN_FF_EXTENDED                  = 1U                                                 /*!< extended format frame / filter */
} can_ff_enum;

/* frame type */
typedef enum {
    CAN_FT_DATA                      = 0U,                                                /*!< data frame */
    CAN_FT_REMOTE                    = 1U                                                 /*!< remote frame */
} can_frame_type_enum;

/* operation mode for determining a timeout */
typedef enum {
    CAN_TIMEOUT_CONTINUOUS           = 0U,                                                /*!< timeout continuous operation */
    CAN_TIMEOUT_TXFIFO               = 1U,                                                /*!< timeout controlled by Tx FIFO */
    CAN_TIMEOUT_RXFIFO0              = 2U,                                                /*!< timeout controlled by Rx FIFO 0 */
    CAN_TIMEOUT_RXFIFO1              = 3U                                                 /*!< timeout controlled by Rx FIFO 1 */
} can_timeout_mode_enum;

/* filter type */
typedef enum {
    CAN_FILTER_RANGE                 = 0U,                                                /*!< range filter from SFID1 to SFID2 (SFID2 >= SFID1) */
    CAN_FILTER_DUAL                  = 1U,                                                /*!< dual ID filter for SFID1 or SFID2 */
    CAN_FILTER_MASK                  = 2U,                                                /*!< classic filter: SFID1 = filter, SFID2 = mask */
    CAN_FILTER_RANGE_NOMASK_DISABLE  = 3U                                                 /*!< range filter SFID1 to SFID2, EIDM mask not applied */
} can_filter_type_enum;

/* filter element configuration */
typedef enum {
    CAN_FILTER_DISABLE               = 0U,                                                /*!< disable filter element */
    CAN_FILTER_TO_RXFIFO0            = 1U,                                                /*!< store in Rx FIFO 0 if filter matches */
    CAN_FILTER_TO_RXFIFO1            = 2U,                                                /*!< store in Rx FIFO 1 if filter matches */
    CAN_FILTER_REJECT                = 3U,                                                /*!< reject element if filter matches */
    CAN_FILTER_HP                    = 4U,                                                /*!< set high priority if filter matches */
    CAN_FILTER_TO_RXFIFO0_HP         = 5U,                                                /*!< set high priority and store in FIFO 0 if filter matches */
    CAN_FILTER_TO_RXFIFO1_HP         = 6U,                                                /*!< set high priority and store in FIFO 1 if filter matches */
    CAN_FILTER_TO_RXBUFFER           = 7U                                                 /*!< store into Rx Buffer, filter element is Rx Buffer index */
} can_filter_element_enum;

/* storage type */
typedef enum {
    CAN_RXFIFO0                      = 0U,                                                /*!< accept in Rx FIFO 0 */
    CAN_RXFIFO1                      = 1U,                                                /*!< accept in Rx FIFO 1 */
    CAN_RXBUFFER                     = 2U                                                 /*!< accept in Rx buffer */
} can_storage_type_enum;

/* TX pin output control */
typedef enum {
    CAN_TX_CONTROL_NORMAL            = 0U,                                                /*!< CAN_TX pin is controlled by the CAN core */
    CAN_TX_CONTROL_SAMPLE_POINT      = 1U,                                                /*!< sample point can be monitored at CAN_TX pin */
    CAN_TX_CONTROL_DOMINANT          = 2U,                                                /*!< CAN_TX pin drives a dominant state (low) */
    CAN_TX_CONTROL_RECESSIVE         = 3U                                                 /*!< CAN_TX pin drives a recessive state (high) */
} can_tx_control_enum;

/* message storage indicator */
typedef enum {
    CAN_MSI_NO_STORE                 = 0U,                                                /*!< message is not stored */
    CAN_MSI_MESSAGE_LOST             = 1U,                                                /*!< FIFO message lost */
    CAN_MSI_RXFIFO0                  = 2U,                                                /*!< FIFO 0 message available */
    CAN_MSI_RXFIFO1                  = 3U                                                 /*!< FIFO 1 message available */
} can_msi_enum;

/* TX event type */
typedef enum {
    CAN_NONE                         = 1U,                                                /*!< reserved */
    CAN_TX                           = 1U,                                                /*!< Tx event */
    CAN_TX_AFTER_CANCEL              = 2U,                                                /*!< transmission in spite of cancellation */
} can_tx_ev_type_enum;

/* error status */
typedef enum {
    CAN_ERROR_NONE                   = 0U,                                                /*!< no error */
    CAN_ERROR_STUFF                  = 1U,                                                /*!< stuff error */
    CAN_ERROR_FORM                   = 2U,                                                /*!< form error */
    CAN_ERROR_ACK                    = 3U,                                                /*!< acknowledge error */
    CAN_ERROR_RECESSIVE_BIT          = 4U,                                                /*!< recessive bit error */
    CAN_ERROR_DOMINANT_BIT           = 5U,                                                /*!< dominant bit error */
    CAN_ERROR_CRC                    = 6U,                                                /*!< CRC error */
    CAN_ERROR_NOCHANGE               = 7U                                                 /*!< no CAN bus event was detected since the last CPU read access to the register */
} can_error_enum;

