sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* protocol activity */
typedef enum {
    CAN_ACTIVITY_SYNC                = 0U,                                                /*!< synchronizing */
    CAN_ACTIVITY_IDLE                = 1U,                                                /*!< idle state */
    CAN_ACTIVITY_RX                  = 2U,                                                /*!< reception state */
    CAN_ACTIVITY_TX                  = 3U                                                 /*!< transmission state */
} can_activity_enum;

/* fifo type */
typedef enum {
    CAN_FIFO_TX                      = 0U,                                                /*!< Tx FIFO */
    CAN_FIFO_RX0                     = 1U,                                                /*!< Rx FIFO 0 */
    CAN_FIFO_RX1                     = 2U,                                                /*!< Rx FIFO 1 */
    CAN_FIFO_TXEVENT                 = 3U                                                 /*!< Tx event FIFO */
} can_fifo_type_enum;

/* CAN memory error flags */
typedef enum {
    CAN_FLAG_NCE_EAE                 = CAN_MERRSTAT_NCE_EAEF,                             /*!< noncorrectable ECC after EDC error flag */
    CAN_FLAG_NCE_AEDC                = CAN_MERRSTAT_NCE_AEDCF,                            /*!< noncorrectable address EDC error flag */
    CAN_FLAG_NCDE                    = CAN_MERRSTAT_NCDEF,                                /*!< noncorrectable double bit error flag */
    CAN_FLAG_BUFOV                   = CAN_MERRSTAT_BUFOVF,                               /*!< correctable error record buffer overflow flag */
    CAN_FLAG_CEOV                    = CAN_MERRSTAT_CEOVF,                                /*!< correctable error overflow flag */
    CAN_FLAG_NCEOV                   = CAN_MERRSTAT_NCEOVF,                               /*!< noncorrectable error overflow flag */
    CAN_FLAG_CE                      = CAN_MERRSTAT_CEF                                   /*!< correctable error flag */
} can_memerr_flag_enum;

/* CAN memory error interrupt flags */
typedef enum {
    CAN_INT_FLAG_CE                  = CAN_MERRSTAT_CEF,                                  /*!< correctable error interrupt flag */
    CAN_INT_FLAG_NCE                 = (CAN_MERRSTAT_NCE_EAEF | CAN_MERRSTAT_NCE_AEDCF | CAN_MERRSTAT_NCDEF)  /*!< noncorrectable error interrupt flag */
} can_memerr_interrupt_flag_enum;

/* CAN memory error interrupts */
typedef enum {
    CAN_INT_CE                       = CAN_MERRCTL_CEIE,                                  /*!< correctable error interrupt */
    CAN_INT_NCE                      = CAN_MERRCTL_NCEIE                                  /*!< noncorrectable error interrupt */
} can_memerr_interrupt_enum;

/* CAN flags */
typedef enum {
    /* flags in CAN_M_CAN_IR register */
    CAN_FLAG_RFIFO0_NEW              = CAN_REGIDX_BIT(IR_REG_OFFSET, 0U),                 /*!< Rx FIFO 0 new message flag */
    CAN_FLAG_RFIFO0_WM               = CAN_REGIDX_BIT(IR_REG_OFFSET, 1U),                 /*!< Rx FIFO 0 watermark reached flag */
    CAN_FLAG_RFIFO0_FULL             = CAN_REGIDX_BIT(IR_REG_OFFSET, 2U),                 /*!< Rx FIFO 0 full flag */
    CAN_FLAG_RFIFO0_MESLOST          = CAN_REGIDX_BIT(IR_REG_OFFSET, 3U),                 /*!< Rx FIFO 0 message lost flag */
    CAN_FLAG_RFIFO1_NEW              = CAN_REGIDX_BIT(IR_REG_OFFSET, 4U),                 /*!< Rx FIFO 1 new message flag */
    CAN_FLAG_RFIFO1_WM               = CAN_REGIDX_BIT(IR_REG_OFFSET, 5U),                 /*!< Rx FIFO 1 watermark reached flag */
    CAN_FLAG_RFIFO1_FULL             = CAN_REGIDX_BIT(IR_REG_OFFSET, 6U),                 /*!< Rx FIFO 1 full flag */
    CAN_FLAG_RFIFO1_MESLOST          = CAN_REGIDX_BIT(IR_REG_OFFSET, 7U),                 /*!< Rx FIFO 1 message lost flag */
    CAN_FLAG_HIGH_PRI_MES            = CAN_REGIDX_BIT(IR_REG_OFFSET, 8U),                 /*!< high priority message flag */
    CAN_FLAG_TX_COMPLETE             = CAN_REGIDX_BIT(IR_REG_OFFSET, 9U),                 /*!< transmission completed flag */
    CAN_FLAG_TX_CANCELLED            = CAN_REGIDX_BIT(IR_REG_OFFSET, 10U),                /*!< transmission cancellation finished flag */
    CAN_FLAG_TXFIFO_EMPTY            = CAN_REGIDX_BIT(IR_REG_OFFSET, 11U),                /*!< Tx FIFO empty flag */
    CAN_FLAG_TXEVFIFO_NEW            = CAN_REGIDX_BIT(IR_REG_OFFSET, 12U),                /*!< Tx event FIFO new entry flag */
    CAN_FLAG_TXEVFIFO_WM             = CAN_REGIDX_BIT(IR_REG_OFFSET, 13U),                /*!< Tx event FIFO watermark reached flag */
    CAN_FLAG_TXEVFIFO_FULL           = CAN_REGIDX_BIT(IR_REG_OFFSET, 14U),                /*!< Tx event FIFO full flag */
    CAN_FLAG_TXEVFIFO_ELELOST        = CAN_REGIDX_BIT(IR_REG_OFFSET, 15U),                /*!< Tx event FIFO element lost flag */
    CAN_FLAG_TIMESTAMP_WRAP          = CAN_REGIDX_BIT(IR_REG_OFFSET, 16U),                /*!< timestamp wraparound flag */
    CAN_FLAG_RAM_ACCESS_FAIL         = CAN_REGIDX_BIT(IR_REG_OFFSET, 17U),                /*!< message RAM access failure flag */
    CAN_FLAG_TIMEOUT                 = CAN_REGIDX_BIT(IR_REG_OFFSET, 18U),                /*!< timeout occurred flag */
    CAN_FLAG_RXBUFFER_NEW            = CAN_REGIDX_BIT(IR_REG_OFFSET, 19U),                /*!< message stored to dedicated Rx buffer flag */
    CAN_FLAG_ERRLOG_OVERFLOW         = CAN_REGIDX_BIT(IR_REG_OFFSET, 22U),                /*!< error logging overflow flag */
    CAN_FLAG_ERR_PASSIVE_CHANGE      = CAN_REGIDX_BIT(IR_REG_OFFSET, 23U),                /*!< error passive change flag */
    CAN_FLAG_WARNING_CHANGE          = CAN_REGIDX_BIT(IR_REG_OFFSET, 24U),                /*!< warning status change flag */
    CAN_FLAG_BUSOFF_CHANGE           = CAN_REGIDX_BIT(IR_REG_OFFSET, 25U),                /*!< bus_off status change flag */
    CAN_FLAG_WATCHDOG                = CAN_REGIDX_BIT(IR_REG_OFFSET, 26U),                /*!< watchdog interrupt flag */
    CAN_FLAG_PROT_ERR_ARBITRATION    = CAN_REGIDX_BIT(IR_REG_OFFSET, 27U),                /*!< protocol error in arbitration phase flag */
    CAN_FLAG_PROT_ERR_DATA           = CAN_REGIDX_BIT(IR_REG_OFFSET, 28U),                /*!< protocol error in data phase flag */
    /* CAN_M_CAN_TXBTIE interrupts */
    CAN_FLAG_TXBUF0_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 0U),              /*!< Tx buffer 0 transmission flag */
    CAN_FLAG_TXBUF1_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 1U),              /*!< Tx buffer 1 transmission flag */
    CAN_FLAG_TXBUF2_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 2U),              /*!< Tx buffer 2 transmission flag */
    CAN_FLAG_TXBUF3_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 3U),              /*!< Tx buffer 3 transmission flag */
    CAN_FLAG_TXBUF4_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 4U),              /*!< Tx buffer 4 transmission flag */
    CAN_FLAG_TXBUF5_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 5U),              /*!< Tx buffer 5 transmission flag */
    CAN_FLAG_TXBUF6_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 6U),              /*!< Tx buffer 6 transmission flag */
    CAN_FLAG_TXBUF7_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 7U),              /*!< Tx buffer 7 transmission flag */
    CAN_FLAG_TXBUF8_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 8U),              /*!< Tx buffer 8 transmission flag */
    CAN_FLAG_TXBUF9_COMPLETE         = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 9U),              /*!< Tx buffer 9 transmission flag */
    CAN_FLAG_TXBUF10_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 10U),             /*!< Tx buffer 10 transmission flag */
    CAN_FLAG_TXBUF11_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 11U),             /*!< Tx buffer 11 transmission flag */
    CAN_FLAG_TXBUF12_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 12U),             /*!< Tx buffer 12 transmission flag */
    CAN_FLAG_TXBUF13_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 13U),             /*!< Tx buffer 13 transmission flag */
    CAN_FLAG_TXBUF14_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 14U),             /*!< Tx buffer 14 transmission flag */
    CAN_FLAG_TXBUF15_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 15U),             /*!< Tx buffer 15 transmission flag */
    CAN_FLAG_TXBUF16_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 16U),             /*!< Tx buffer 16 transmission flag */
    CAN_FLAG_TXBUF17_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 17U),             /*!< Tx buffer 17 transmission flag */
    CAN_FLAG_TXBUF18_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 18U),             /*!< Tx buffer 18 transmission flag */
    CAN_FLAG_TXBUF19_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 19U),             /*!< Tx buffer 19 transmission flag */
    CAN_FLAG_TXBUF20_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 20U),             /*!< Tx buffer 20 transmission flag */
    CAN_FLAG_TXBUF21_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 21U),             /*!< Tx buffer 21 transmission flag */
    CAN_FLAG_TXBUF22_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 22U),             /*!< Tx buffer 22 transmission flag */
    CAN_FLAG_TXBUF23_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 23U),             /*!< Tx buffer 23 transmission flag */
    CAN_FLAG_TXBUF24_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 24U),             /*!< Tx buffer 24 transmission flag */
    CAN_FLAG_TXBUF25_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 25U),             /*!< Tx buffer 25 transmission flag */
    CAN_FLAG_TXBUF26_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 26U),             /*!< Tx buffer 26 transmission flag */
    CAN_FLAG_TXBUF27_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 27U),             /*!< Tx buffer 27 transmission flag */
    CAN_FLAG_TXBUF28_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 28U),             /*!< Tx buffer 28 transmission flag */
    CAN_FLAG_TXBUF29_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 29U),             /*!< Tx buffer 29 transmission flag */
    CAN_FLAG_TXBUF30_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 30U),             /*!< Tx buffer 30 transmission flag */
    CAN_FLAG_TXBUF31_COMPLETE        = CAN_REGIDX_BIT(TXBTO_REG_OFFSET, 31U),             /*!< Tx buffer 31 transmission flag */
    /* CAN_M_CAN_TXBCIE interrupts */
    CAN_FLAG_TXBUF0_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 0U),              /*!< Tx buffer 0 transmission cancel finished flag */
    CAN_FLAG_TXBUF1_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 1U),              /*!< Tx buffer 1 transmission cancel finished flag */
    CAN_FLAG_TXBUF2_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 2U),              /*!< Tx buffer 2 transmission cancel finished flag */
    CAN_FLAG_TXBUF3_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 3U),              /*!< Tx buffer 3 transmission cancel finished flag */
    CAN_FLAG_TXBUF4_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 4U),              /*!< Tx buffer 4 transmission cancel finished flag */
    CAN_FLAG_TXBUF5_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 5U),              /*!< Tx buffer 5 transmission cancel finished flag */
    CAN_FLAG_TXBUF6_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 6U),              /*!< Tx buffer 6 transmission cancel finished flag */
    CAN_FLAG_TXBUF7_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 7U),              /*!< Tx buffer 7 transmission cancel finished flag */
    CAN_FLAG_TXBUF8_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 8U),              /*!< Tx buffer 8 transmission cancel finished flag */
    CAN_FLAG_TXBUF9_CANCELLED        = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 9U),              /*!< Tx buffer 9 transmission cancel finished flag */
    CAN_FLAG_TXBUF10_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 10U),             /*!< Tx buffer 10 transmission cancel finished flag */
    CAN_FLAG_TXBUF11_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 11U),             /*!< Tx buffer 11 transmission cancel finished flag */
    CAN_FLAG_TXBUF12_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 12U),             /*!< Tx buffer 12 transmission cancel finished flag */
    CAN_FLAG_TXBUF13_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 13U),             /*!< Tx buffer 13 transmission cancel finished flag */
    CAN_FLAG_TXBUF14_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 14U),             /*!< Tx buffer 14 transmission cancel finished flag */
    CAN_FLAG_TXBUF15_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 15U),             /*!< Tx buffer 15 transmission cancel finished flag */
    CAN_FLAG_TXBUF16_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 16U),             /*!< Tx buffer 16 transmission cancel finished flag */
    CAN_FLAG_TXBUF17_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 17U),             /*!< Tx buffer 17 transmission cancel finished flag */
    CAN_FLAG_TXBUF18_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 18U),             /*!< Tx buffer 18 transmission cancel finished flag */
    CAN_FLAG_TXBUF19_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 19U),             /*!< Tx buffer 19 transmission cancel finished flag */
    CAN_FLAG_TXBUF20_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 20U),             /*!< Tx buffer 20 transmission cancel finished flag */
    CAN_FLAG_TXBUF21_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 21U),             /*!< Tx buffer 21 transmission cancel finished flag */
    CAN_FLAG_TXBUF22_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 22U),             /*!< Tx buffer 22 transmission cancel finished flag */
    CAN_FLAG_TXBUF23_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 23U),             /*!< Tx buffer 23 transmission cancel finished flag */
    CAN_FLAG_TXBUF24_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 24U),             /*!< Tx buffer 24 transmission cancel finished flag */
    CAN_FLAG_TXBUF25_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 25U),             /*!< Tx buffer 25 transmission cancel finished flag */
    CAN_FLAG_TXBUF26_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 26U),             /*!< Tx buffer 26 transmission cancel finished flag */
    CAN_FLAG_TXBUF27_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 27U),             /*!< Tx buffer 27 transmission cancel finished flag */
    CAN_FLAG_TXBUF28_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 28U),             /*!< Tx buffer 28 transmission cancel finished flag */
    CAN_FLAG_TXBUF29_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 29U),             /*!< Tx buffer 29 transmission cancel finished flag */
    CAN_FLAG_TXBUF30_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 30U),             /*!< Tx buffer 30 transmission cancel finished flag */
    CAN_FLAG_TXBUF31_CANCELLED       = CAN_REGIDX_BIT(TXBCF_REG_OFFSET, 31U),             /*!< Tx buffer 31 transmission cancel finished flag */
    /* flags in CAN_DMU_DMUIR register */
    DMU_FLAG_TX_ELE_NOT_STADDR       = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 0U),              /*!< TX element not start address flag */
    DMU_FLAG_TX_ELE_ILLE_ENQ         = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 1U),              /*!< TX element illegal enqueueing flag */
    DMU_FLAG_TX_ELE_ILLE_ACCSEQ      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 2U),              /*!< TX element illegal access sequence flag */
    DMU_FLAG_TX_ELE_ILLE_DLC         = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 3U),              /*!< TX element illegal DLC flag */
    DMU_FLAG_TX_ELE_WRITE_AFTTRIG    = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 4U),              /*!< TX element write after trigger address flag */
    DMU_FLAG_TX_ELE_ILLE_READ        = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 5U),              /*!< TX element illegal read flag */
    DMU_FLAG_TX_ELE_ENQ              = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 6U),              /*!< TX element enqueued flag */
    DMU_FLAG_RX0_ELE_NOT_STADDR      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 8U),              /*!< RX0 element not start address flag */
    DMU_FLAG_RX0_ELE_ILLE_DEQ        = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 9U),              /*!< RX0 element illegal dequeueing flag */
    DMU_FLAG_RX0_ELE_ILLE_ACCSEQ     = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 10U),             /*!< RX0 element illegal access sequence flag */
    DMU_FLAG_RX0_ELE_ILLE_WRITE      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 11U),             /*!< RX0 element illegal write flag */
    DMU_FLAG_RX0_ELE_DEQ             = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 12U),             /*!< RX0 element dequeued flag */
    DMU_FLAG_RX1_ELE_NOT_STADDR      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 16U),             /*!< RX1 element not start address flag */
    DMU_FLAG_RX1_ELE_ILLE_DEQ        = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 17U),             /*!< RX1 element illegal dequeueing flag */
    DMU_FLAG_RX1_ELE_ILLE_ACCSEQ     = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 18U),             /*!< RX1 element illegal access sequence flag */
    DMU_FLAG_RX1_ELE_ILLE_WRITE      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 19U),             /*!< RX1 element illegal write flag */
    DMU_FLAG_RX1_ELE_DEQ             = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 20U),             /*!< RX1 element dequeued flag */
    DMU_FLAG_TXEV_ELE_NOT_STADDR     = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 24U),             /*!< TX event element not start address flag */
    DMU_FLAG_TXEV_ELE_ILLE_DEQ       = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 25U),             /*!< TX event element illegal dequeueing flag */
    DMU_FLAG_TXEV_ELE_ILLE_ACCSEQ    = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 26U),             /*!< TX event element illegal access sequence flag */
    DMU_FLAG_TXEV_ELE_ILLE_WRITE     = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 27U),             /*!< TX event element illegal write flag */
    DMU_FLAG_TXEV_ELE_DEQ            = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 28U),             /*!< TX event element dequeued flag */
    DMU_FLAG_ILLE_ACC_IN_CONFIG      = CAN_REGIDX_BIT(DMUIR_REG_OFFSET, 30U)              /*!< illegal access while in configuration mode flag */
} can_dtmcan_flag_enum;

