sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN interrupt flag */
typedef enum {
    /* CAN_M_CAN_IR interrupt flags */
    CAN_INT_FLAG_RFIFO0_NEW                   = CAN_REGIDX_BIT2(IE_REG_OFFSET, 0U, IR_REG_OFFSET, 0U),                /*!< Rx FIFO 0 new message interrupt */
    CAN_INT_FLAG_RFIFO0_WM                    = CAN_REGIDX_BIT2(IE_REG_OFFSET, 1U, IR_REG_OFFSET, 1U),                /*!< Rx FIFO 0 watermark reached interrupt */
    CAN_INT_FLAG_RFIFO0_FULL                  = CAN_REGIDX_BIT2(IE_REG_OFFSET, 2U, IR_REG_OFFSET, 2U),                /*!< Rx FIFO 0 full interrupt */
    CAN_INT_FLAG_RFIFO0_MESLOST               = CAN_REGIDX_BIT2(IE_REG_OFFSET, 3U, IR_REG_OFFSET, 3U),                /*!< Rx FIFO 0 message lost interrupt */
    CAN_INT_FLAG_RFIFO1_NEW                   = CAN_REGIDX_BIT2(IE_REG_OFFSET, 4U, IR_REG_OFFSET, 4U),                /*!< Rx FIFO 1 new message interrupt */
    CAN_INT_FLAG_RFIFO1_WM                    = CAN_REGIDX_BIT2(IE_REG_OFFSET, 5U, IR_REG_OFFSET, 5U),                /*!< Rx FIFO 1 watermark reached interrupt */
    CAN_INT_FLAG_RFIFO1_FULL                  = CAN_REGIDX_BIT2(IE_REG_OFFSET, 6U, IR_REG_OFFSET, 6U),                /*!< Rx FIFO 1 full interrupt */
    CAN_INT_FLAG_RFIFO1_MESLOST               = CAN_REGIDX_BIT2(IE_REG_OFFSET, 7U, IR_REG_OFFSET, 7U),                /*!< Rx FIFO 1 message lost interrupt */
    CAN_INT_FLAG_HIGH_PRI_MES                 = CAN_REGIDX_BIT2(IE_REG_OFFSET, 8U, IR_REG_OFFSET, 8U),                /*!< high priority message interrupt */
    CAN_INT_FLAG_TX_COMPLETE                  = CAN_REGIDX_BIT2(IE_REG_OFFSET, 9U, IR_REG_OFFSET, 9U),                /*!< transmission completed interrupt */
    CAN_INT_FLAG_TX_CANCELLED                 = CAN_REGIDX_BIT2(IE_REG_OFFSET, 10U, IR_REG_OFFSET, 10U),              /*!< transmission cancellation finished interrupt */
    CAN_INT_FLAG_TXFIFO_EMPTY                 = CAN_REGIDX_BIT2(IE_REG_OFFSET, 11U, IR_REG_OFFSET, 11U),              /*!< Tx FIFO empty interrupt */
    CAN_INT_FLAG_TXEVFIFO_NEW                 = CAN_REGIDX_BIT2(IE_REG_OFFSET, 12U, IR_REG_OFFSET, 12U),              /*!< Tx event FIFO new entry interrupt */
    CAN_INT_FLAG_TXEVFIFO_WM                  = CAN_REGIDX_BIT2(IE_REG_OFFSET, 13U, IR_REG_OFFSET, 13U),              /*!< Tx event FIFO watermark reached interrupt */
    CAN_INT_FLAG_TXEVFIFO_FULL                = CAN_REGIDX_BIT2(IE_REG_OFFSET, 14U, IR_REG_OFFSET, 14U),              /*!< Tx event FIFO full interrupt */
    CAN_INT_FLAG_TXEVFIFO_ELELOST             = CAN_REGIDX_BIT2(IE_REG_OFFSET, 15U, IR_REG_OFFSET, 15U),              /*!< Tx event FIFO element lost interrupt */
    CAN_INT_FLAG_TIMESTAMP_WRAP               = CAN_REGIDX_BIT2(IE_REG_OFFSET, 16U, IR_REG_OFFSET, 16U),              /*!< timestamp wraparound interrupt */
    CAN_INT_FLAG_RAM_ACCESS_FAIL              = CAN_REGIDX_BIT2(IE_REG_OFFSET, 17U, IR_REG_OFFSET, 17U),              /*!< message RAM access failure interrupt */
    CAN_INT_FLAG_TIMEOUT                      = CAN_REGIDX_BIT2(IE_REG_OFFSET, 18U, IR_REG_OFFSET, 18U),              /*!< timeout occurred interrupt */
    CAN_INT_FLAG_RXBUFFER_NEW                 = CAN_REGIDX_BIT2(IE_REG_OFFSET, 19U, IR_REG_OFFSET, 19U),              /*!< message stored to dedicated Rx buffer interrupt */
    CAN_INT_FLAG_ERRLOG_OVERFLOW              = CAN_REGIDX_BIT2(IE_REG_OFFSET, 22U, IR_REG_OFFSET, 22U),              /*!< error logging overflow interrupt */
    CAN_INT_FLAG_ERR_PASSIVE_CHANGE           = CAN_REGIDX_BIT2(IE_REG_OFFSET, 23U, IR_REG_OFFSET, 23U),              /*!< error passive interrupt */
    CAN_INT_FLAG_WARNING_CHANGE               = CAN_REGIDX_BIT2(IE_REG_OFFSET, 24U, IR_REG_OFFSET, 24U),              /*!< warning status interrupt */
    CAN_INT_FLAG_BUSOFF_CHANGE                = CAN_REGIDX_BIT2(IE_REG_OFFSET, 25U, IR_REG_OFFSET, 25U),              /*!< bus_off status interrupt */
    CAN_INT_FLAG_WATCHDOG                     = CAN_REGIDX_BIT2(IE_REG_OFFSET, 26U, IR_REG_OFFSET, 26U),              /*!< watchdog interrupt */
    CAN_INT_FLAG_PROT_ERR_ARBITRATION         = CAN_REGIDX_BIT2(IE_REG_OFFSET, 27U, IR_REG_OFFSET, 27U),              /*!< protocol error in arbitration phase interrupt */
    CAN_INT_FLAG_PROT_ERR_DATA                = CAN_REGIDX_BIT2(IE_REG_OFFSET, 28U, IR_REG_OFFSET, 28U),              /*!< protocol error in data phase interrupt */
    /* CAN_M_CAN_TXBTIE interrupts */
    CAN_INT_FLAG_TXBUF0_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 0U, TXBTO_REG_OFFSET, 0U),         /*!< Tx buffer 0 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF1_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 1U, TXBTO_REG_OFFSET, 1U),         /*!< Tx buffer 1 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF2_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 2U, TXBTO_REG_OFFSET, 2U),         /*!< Tx buffer 2 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF3_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 3U, TXBTO_REG_OFFSET, 3U),         /*!< Tx buffer 3 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF4_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 4U, TXBTO_REG_OFFSET, 4U),         /*!< Tx buffer 4 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF5_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 5U, TXBTO_REG_OFFSET, 5U),         /*!< Tx buffer 5 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF6_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 6U, TXBTO_REG_OFFSET, 6U),         /*!< Tx buffer 6 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF7_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 7U, TXBTO_REG_OFFSET, 7U),         /*!< Tx buffer 7 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF8_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 8U, TXBTO_REG_OFFSET, 8U),         /*!< Tx buffer 8 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF9_COMPLETE              = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 9U, TXBTO_REG_OFFSET, 9U),         /*!< Tx buffer 9 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF10_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 10U, TXBTO_REG_OFFSET, 10U),       /*!< Tx buffer 10 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF11_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 11U, TXBTO_REG_OFFSET, 11U),       /*!< Tx buffer 11 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF12_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 12U, TXBTO_REG_OFFSET, 12U),       /*!< Tx buffer 12 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF13_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 13U, TXBTO_REG_OFFSET, 13U),       /*!< Tx buffer 13 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF14_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 14U, TXBTO_REG_OFFSET, 14U),       /*!< Tx buffer 14 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF15_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 15U, TXBTO_REG_OFFSET, 15U),       /*!< Tx buffer 15 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF16_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 16U, TXBTO_REG_OFFSET, 16U),       /*!< Tx buffer 16 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF17_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 17U, TXBTO_REG_OFFSET, 17U),       /*!< Tx buffer 17 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF18_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 18U, TXBTO_REG_OFFSET, 18U),       /*!< Tx buffer 18 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF19_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 19U, TXBTO_REG_OFFSET, 19U),       /*!< Tx buffer 19 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF20_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 20U, TXBTO_REG_OFFSET, 20U),       /*!< Tx buffer 20 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF21_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 21U, TXBTO_REG_OFFSET, 21U),       /*!< Tx buffer 21 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF22_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 22U, TXBTO_REG_OFFSET, 22U),       /*!< Tx buffer 22 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF23_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 23U, TXBTO_REG_OFFSET, 23U),       /*!< Tx buffer 23 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF24_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 24U, TXBTO_REG_OFFSET, 24U),       /*!< Tx buffer 24 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF25_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 25U, TXBTO_REG_OFFSET, 25U),       /*!< Tx buffer 25 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF26_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 26U, TXBTO_REG_OFFSET, 26U),       /*!< Tx buffer 26 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF27_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 27U, TXBTO_REG_OFFSET, 27U),       /*!< Tx buffer 27 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF28_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 28U, TXBTO_REG_OFFSET, 28U),       /*!< Tx buffer 28 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF29_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 29U, TXBTO_REG_OFFSET, 29U),       /*!< Tx buffer 29 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF30_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 30U, TXBTO_REG_OFFSET, 30U),       /*!< Tx buffer 30 transmission interrupt flag */
    CAN_INT_FLAG_TXBUF31_COMPLETE             = CAN_REGIDX_BIT2(TXBTIE_REG_OFFSET, 31U, TXBTO_REG_OFFSET, 31U),       /*!< Tx buffer 31 transmission interrupt flag */
    /* CAN_M_CAN_TXBCIE interrupts */
    CAN_INT_FLAG_TXBUF0_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 0U, TXBCF_REG_OFFSET, 0U),         /*!< Tx buffer 0 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF1_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 1U, TXBCF_REG_OFFSET, 1U),         /*!< Tx buffer 1 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF2_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 2U, TXBCF_REG_OFFSET, 2U),         /*!< Tx buffer 2 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF3_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 3U, TXBCF_REG_OFFSET, 3U),         /*!< Tx buffer 3 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF4_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 4U, TXBCF_REG_OFFSET, 4U),         /*!< Tx buffer 4 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF5_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 5U, TXBCF_REG_OFFSET, 5U),         /*!< Tx buffer 5 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF6_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 6U, TXBCF_REG_OFFSET, 6U),         /*!< Tx buffer 6 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF7_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 7U, TXBCF_REG_OFFSET, 7U),         /*!< Tx buffer 7 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF8_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 8U, TXBCF_REG_OFFSET, 8U),         /*!< Tx buffer 8 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF9_CANCELLED             = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 9U, TXBCF_REG_OFFSET, 9U),         /*!< Tx buffer 9 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF10_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 10U, TXBCF_REG_OFFSET, 10U),       /*!< Tx buffer 10 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF11_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 11U, TXBCF_REG_OFFSET, 11U),       /*!< Tx buffer 11 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF12_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 12U, TXBCF_REG_OFFSET, 12U),       /*!< Tx buffer 12 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF13_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 13U, TXBCF_REG_OFFSET, 13U),       /*!< Tx buffer 13 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF14_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 14U, TXBCF_REG_OFFSET, 14U),       /*!< Tx buffer 14 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF15_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 15U, TXBCF_REG_OFFSET, 15U),       /*!< Tx buffer 15 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF16_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 16U, TXBCF_REG_OFFSET, 16U),       /*!< Tx buffer 16 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF17_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 17U, TXBCF_REG_OFFSET, 17U),       /*!< Tx buffer 17 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF18_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 18U, TXBCF_REG_OFFSET, 18U),       /*!< Tx buffer 18 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF19_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 19U, TXBCF_REG_OFFSET, 19U),       /*!< Tx buffer 19 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF20_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 20U, TXBCF_REG_OFFSET, 20U),       /*!< Tx buffer 20 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF21_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 21U, TXBCF_REG_OFFSET, 21U),       /*!< Tx buffer 21 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF22_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 22U, TXBCF_REG_OFFSET, 22U),       /*!< Tx buffer 22 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF23_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 23U, TXBCF_REG_OFFSET, 23U),       /*!< Tx buffer 23 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF24_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 24U, TXBCF_REG_OFFSET, 24U),       /*!< Tx buffer 24 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF25_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 25U, TXBCF_REG_OFFSET, 25U),       /*!< Tx buffer 25 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF26_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 26U, TXBCF_REG_OFFSET, 26U),       /*!< Tx buffer 26 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF27_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 27U, TXBCF_REG_OFFSET, 27U),       /*!< Tx buffer 27 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF28_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 28U, TXBCF_REG_OFFSET, 28U),       /*!< Tx buffer 28 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF29_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 29U, TXBCF_REG_OFFSET, 29U),       /*!< Tx buffer 29 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF30_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 30U, TXBCF_REG_OFFSET, 30U),       /*!< Tx buffer 30 transmission cancel finished interrupt flag */
    CAN_INT_FLAG_TXBUF31_CANCELLED            = CAN_REGIDX_BIT2(TXBCIE_REG_OFFSET, 31U, TXBCF_REG_OFFSET, 31U),       /*!< Tx buffer 31 transmission cancel finished interrupt flag */
    /* CAN_DMU_DMUIR interrupt flags */
    DMU_INT_FLAG_TX_ELE_NOT_STADDR            = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 0U, DMUIR_REG_OFFSET, 0U),          /*!< TX element not start address interrupt */
    DMU_INT_FLAG_TX_ELE_ILLE_ENQ              = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 1U, DMUIR_REG_OFFSET, 1U),          /*!< TX element illegal enqueueing interrupt */
    DMU_INT_FLAG_TX_ELE_ILLE_ACCSEQ           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 2U, DMUIR_REG_OFFSET, 2U),          /*!< TX element illegal access sequence interrupt */
    DMU_INT_FLAG_TX_ELE_ILLE_DLC              = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 3U, DMUIR_REG_OFFSET, 3U),          /*!< TX element illegal DLC interrupt */
    DMU_INT_FLAG_TX_ELE_WRITE_AFTTRIG         = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 4U, DMUIR_REG_OFFSET, 4U),          /*!< TX element write after trigger address interrupt */
    DMU_INT_FLAG_TX_ELE_ILLE_READ             = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 5U, DMUIR_REG_OFFSET, 5U),          /*!< TX element illegal read interrupt */
    DMU_INT_FLAG_TX_ELE_ENQ                   = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 6U, DMUIR_REG_OFFSET, 6U),          /*!< TX element enqueued interrupt */
    DMU_INT_FLAG_RX0_ELE_NOT_STADDR           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 8U, DMUIR_REG_OFFSET, 8U),          /*!< RX0 element not start address interrupt */
    DMU_INT_FLAG_RX0_ELE_ILLE_DEQ             = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 9U, DMUIR_REG_OFFSET, 9U),          /*!< RX0 element illegal dequeueing interrupt */
    DMU_INT_FLAG_RX0_ELE_ILLE_ACCSEQ          = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 10U, DMUIR_REG_OFFSET, 10U),        /*!< RX0 element illegal access sequence interrupt */
    DMU_INT_FLAG_RX0_ELE_ILLE_WRITE           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 11U, DMUIR_REG_OFFSET, 11U),        /*!< RX0 element illegal write interrupt */
    DMU_INT_FLAG_RX0_ELE_DEQ                  = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 12U, DMUIR_REG_OFFSET, 12U),        /*!< RX0 element dequeued interrupt */
    DMU_INT_FLAG_RX1_ELE_NOT_STADDR           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 16U, DMUIR_REG_OFFSET, 16U),        /*!< RX1 element not start address interrupt */
    DMU_INT_FLAG_RX1_ELE_ILLE_DEQ             = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 17U, DMUIR_REG_OFFSET, 17U),        /*!< RX1 element illegal dequeueing interrupt */
    DMU_INT_FLAG_RX1_ELE_ILLE_ACCSEQ          = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 18U, DMUIR_REG_OFFSET, 18U),        /*!< RX1 element illegal access sequence interrupt */
    DMU_INT_FLAG_RX1_ELE_ILLE_WRITE           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 19U, DMUIR_REG_OFFSET, 19U),        /*!< RX1 element illegal write interrupt */
    DMU_INT_FLAG_RX1_ELE_DEQ                  = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 20U, DMUIR_REG_OFFSET, 20U),        /*!< RX1 element dequeued interrupt */
    DMU_INT_FLAG_TXEV_ELE_NOT_STADDR          = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 24U, DMUIR_REG_OFFSET, 24U),        /*!< TX event element not start address interrupt */
    DMU_INT_FLAG_TXEV_ELE_ILLE_DEQ            = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 25U, DMUIR_REG_OFFSET, 25U),        /*!< TX event element illegal dequeueing interrupt */
    DMU_INT_FLAG_TXEV_ELE_ILLE_ACCSEQ         = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 26U, DMUIR_REG_OFFSET, 26U),        /*!< TX event element illegal access sequence interrupt */
    DMU_INT_FLAG_TXEV_ELE_ILLE_WRITE          = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 27U, DMUIR_REG_OFFSET, 27U),        /*!< TX event element illegal write interrupt */
    DMU_INT_FLAG_TXEV_ELE_DEQ                 = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 28U, DMUIR_REG_OFFSET, 28U),        /*!< TX event element dequeued interrupt */
    DMU_INT_FLAG_ILLE_ACC_IN_CONFIG           = CAN_REGIDX_BIT2(DMUIE_REG_OFFSET, 30U, DMUIR_REG_OFFSET, 30U)         /*!< illegal access while in configuration mode interrupt */
} can_dtmcan_interrupt_flag_enum;

