sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN interrupt flags */
typedef enum {
    /* CAN_M_CAN_IE interrupts */
    CAN_INT_RFIFO0_NEW                        = CAN_REGIDX_BIT(IE_REG_OFFSET, 0U),                 /*!< Rx FIFO 0 new message interrupt */
    CAN_INT_RFIFO0_WM                         = CAN_REGIDX_BIT(IE_REG_OFFSET, 1U),                 /*!< Rx FIFO 0 watermark reached interrupt */
    CAN_INT_RFIFO0_FULL                       = CAN_REGIDX_BIT(IE_REG_OFFSET, 2U),                 /*!< Rx FIFO 0 full interrupt */
    CAN_INT_RFIFO0_MESLOST                    = CAN_REGIDX_BIT(IE_REG_OFFSET, 3U),                 /*!< Rx FIFO 0 message lost interrupt */
    CAN_INT_RFIFO1_NEW                        = CAN_REGIDX_BIT(IE_REG_OFFSET, 4U),                 /*!< Rx FIFO 1 new message interrupt */
    CAN_INT_RFIFO1_WM                         = CAN_REGIDX_BIT(IE_REG_OFFSET, 5U),                 /*!< Rx FIFO 1 watermark reached interrupt */
    CAN_INT_RFIFO1_FULL                       = CAN_REGIDX_BIT(IE_REG_OFFSET, 6U),                 /*!< Rx FIFO 1 full interrupt */
    CAN_INT_RFIFO1_MESLOST                    = CAN_REGIDX_BIT(IE_REG_OFFSET, 7U),                 /*!< Rx FIFO 1 message lost interrupt */
    CAN_INT_HIGH_PRI_MES                      = CAN_REGIDX_BIT(IE_REG_OFFSET, 8U),                 /*!< high priority message interrupt */
    CAN_INT_TX_COMPLETE                       = CAN_REGIDX_BIT(IE_REG_OFFSET, 9U),                 /*!< transmission completed interrupt */
    CAN_INT_TX_CANCELLED                      = CAN_REGIDX_BIT(IE_REG_OFFSET, 10U),                /*!< transmission cancellation finished interrupt */
    CAN_INT_TXFIFO_EMPTY                      = CAN_REGIDX_BIT(IE_REG_OFFSET, 11U),                /*!< Tx FIFO empty interrupt */
    CAN_INT_TXEVFIFO_NEW                      = CAN_REGIDX_BIT(IE_REG_OFFSET, 12U),                /*!< Tx event FIFO new entry interrupt */
    CAN_INT_TXEVFIFO_WM                       = CAN_REGIDX_BIT(IE_REG_OFFSET, 13U),                /*!< Tx event FIFO watermark reached interrupt */
    CAN_INT_TXEVFIFO_FULL                     = CAN_REGIDX_BIT(IE_REG_OFFSET, 14U),                /*!< Tx event FIFO full interrupt */
    CAN_INT_TXEVFIFO_ELELOST                  = CAN_REGIDX_BIT(IE_REG_OFFSET, 15U),                /*!< Tx event FIFO element lost interrupt */
    CAN_INT_TIMESTAMP_WRAP                    = CAN_REGIDX_BIT(IE_REG_OFFSET, 16U),                /*!< timestamp wraparound interrupt */
    CAN_INT_RAM_ACCESS_FAIL                   = CAN_REGIDX_BIT(IE_REG_OFFSET, 17U),                /*!< message RAM access failure interrupt */
    CAN_INT_TIMEOUT                           = CAN_REGIDX_BIT(IE_REG_OFFSET, 18U),                /*!< timeout occurred interrupt */
    CAN_INT_RXBUFFER_NEW                      = CAN_REGIDX_BIT(IE_REG_OFFSET, 19U),                /*!< message stored to dedicated Rx buffer interrupt */
    CAN_INT_ERRLOG_OVERFLOW                   = CAN_REGIDX_BIT(IE_REG_OFFSET, 22U),                /*!< error logging overflow interrupt */
    CAN_INT_ERR_PASSIVE_CHANGE                = CAN_REGIDX_BIT(IE_REG_OFFSET, 23U),                /*!< error passive interrupt */
    CAN_INT_WARNING_CHANGE                    = CAN_REGIDX_BIT(IE_REG_OFFSET, 24U),                /*!< warning status interrupt */
    CAN_INT_BUSOFF_CHANGE                     = CAN_REGIDX_BIT(IE_REG_OFFSET, 25U),                /*!< bus_off status interrupt */
    CAN_INT_WATCHDOG                          = CAN_REGIDX_BIT(IE_REG_OFFSET, 26U),                /*!< watchdog interrupt */
    CAN_INT_PROT_ERR_ARBITRATION              = CAN_REGIDX_BIT(IE_REG_OFFSET, 27U),                /*!< protocol error in arbitration phase interrupt */
    CAN_INT_PROT_ERR_DATA                     = CAN_REGIDX_BIT(IE_REG_OFFSET, 28U),                /*!< protocol error in data phase interrupt */
    /* CAN_M_CAN_TXBTIE interrupts */
    CAN_INT_TXBUF0_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 0U),             /*!< Tx buffer 0 transmission interrupt */
    CAN_INT_TXBUF1_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 1U),             /*!< Tx buffer 1 transmission interrupt */
    CAN_INT_TXBUF2_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 2U),             /*!< Tx buffer 2 transmission interrupt */
    CAN_INT_TXBUF3_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 3U),             /*!< Tx buffer 3 transmission interrupt */
    CAN_INT_TXBUF4_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 4U),             /*!< Tx buffer 4 transmission interrupt */
    CAN_INT_TXBUF5_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 5U),             /*!< Tx buffer 5 transmission interrupt */
    CAN_INT_TXBUF6_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 6U),             /*!< Tx buffer 6 transmission interrupt */
    CAN_INT_TXBUF7_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 7U),             /*!< Tx buffer 7 transmission interrupt */
    CAN_INT_TXBUF8_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 8U),             /*!< Tx buffer 8 transmission interrupt */
    CAN_INT_TXBUF9_COMPLETE                   = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 9U),             /*!< Tx buffer 9 transmission interrupt */
    CAN_INT_TXBUF10_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 10U),            /*!< Tx buffer 10 transmission interrupt */
    CAN_INT_TXBUF11_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 11U),            /*!< Tx buffer 11 transmission interrupt */
    CAN_INT_TXBUF12_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 12U),            /*!< Tx buffer 12 transmission interrupt */
    CAN_INT_TXBUF13_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 13U),            /*!< Tx buffer 13 transmission interrupt */
    CAN_INT_TXBUF14_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 14U),            /*!< Tx buffer 14 transmission interrupt */
    CAN_INT_TXBUF15_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 15U),            /*!< Tx buffer 15 transmission interrupt */
    CAN_INT_TXBUF16_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 16U),            /*!< Tx buffer 16 transmission interrupt */
    CAN_INT_TXBUF17_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 17U),            /*!< Tx buffer 17 transmission interrupt */
    CAN_INT_TXBUF18_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 18U),            /*!< Tx buffer 18 transmission interrupt */
    CAN_INT_TXBUF19_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 19U),            /*!< Tx buffer 19 transmission interrupt */
    CAN_INT_TXBUF20_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 20U),            /*!< Tx buffer 20 transmission interrupt */
    CAN_INT_TXBUF21_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 21U),            /*!< Tx buffer 21 transmission interrupt */
    CAN_INT_TXBUF22_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 22U),            /*!< Tx buffer 22 transmission interrupt */
    CAN_INT_TXBUF23_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 23U),            /*!< Tx buffer 23 transmission interrupt */
    CAN_INT_TXBUF24_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 24U),            /*!< Tx buffer 24 transmission interrupt */
    CAN_INT_TXBUF25_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 25U),            /*!< Tx buffer 25 transmission interrupt */
    CAN_INT_TXBUF26_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 26U),            /*!< Tx buffer 26 transmission interrupt */
    CAN_INT_TXBUF27_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 27U),            /*!< Tx buffer 27 transmission interrupt */
    CAN_INT_TXBUF28_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 28U),            /*!< Tx buffer 28 transmission interrupt */
    CAN_INT_TXBUF29_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 29U),            /*!< Tx buffer 29 transmission interrupt */
    CAN_INT_TXBUF30_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 30U),            /*!< Tx buffer 30 transmission interrupt */
    CAN_INT_TXBUF31_COMPLETE                  = CAN_REGIDX_BIT(TXBTIE_REG_OFFSET, 31U),            /*!< Tx buffer 31 transmission interrupt */
    /* CAN_M_CAN_TXBCIE interrupts */
    CAN_INT_TXBUF0_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 0U),             /*!< Tx buffer 0 transmission cancel finished interrupt */
    CAN_INT_TXBUF1_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 1U),             /*!< Tx buffer 1 transmission cancel finished interrupt */
    CAN_INT_TXBUF2_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 2U),             /*!< Tx buffer 2 transmission cancel finished interrupt */
    CAN_INT_TXBUF3_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 3U),             /*!< Tx buffer 3 transmission cancel finished interrupt */
    CAN_INT_TXBUF4_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 4U),             /*!< Tx buffer 4 transmission cancel finished interrupt */
    CAN_INT_TXBUF5_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 5U),             /*!< Tx buffer 5 transmission cancel finished interrupt */
    CAN_INT_TXBUF6_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 6U),             /*!< Tx buffer 6 transmission cancel finished interrupt */
    CAN_INT_TXBUF7_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 7U),             /*!< Tx buffer 7 transmission cancel finished interrupt */
    CAN_INT_TXBUF8_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 8U),             /*!< Tx buffer 8 transmission cancel finished interrupt */
    CAN_INT_TXBUF9_CANCELLED                  = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 9U),             /*!< Tx buffer 9 transmission cancel finished interrupt */
    CAN_INT_TXBUF10_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 10U),            /*!< Tx buffer 10 transmission cancel finished interrupt */
    CAN_INT_TXBUF11_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 11U),            /*!< Tx buffer 11 transmission cancel finished interrupt */
    CAN_INT_TXBUF12_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 12U),            /*!< Tx buffer 12 transmission cancel finished interrupt */
    CAN_INT_TXBUF13_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 13U),            /*!< Tx buffer 13 transmission cancel finished interrupt */
    CAN_INT_TXBUF14_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 14U),            /*!< Tx buffer 14 transmission cancel finished interrupt */
    CAN_INT_TXBUF15_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 15U),            /*!< Tx buffer 15 transmission cancel finished interrupt */
    CAN_INT_TXBUF16_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 16U),            /*!< Tx buffer 16 transmission cancel finished interrupt */
    CAN_INT_TXBUF17_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 17U),            /*!< Tx buffer 17 transmission cancel finished interrupt */
    CAN_INT_TXBUF18_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 18U),            /*!< Tx buffer 18 transmission cancel finished interrupt */
    CAN_INT_TXBUF19_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 19U),            /*!< Tx buffer 19 transmission cancel finished interrupt */
    CAN_INT_TXBUF20_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 20U),            /*!< Tx buffer 20 transmission cancel finished interrupt */
    CAN_INT_TXBUF21_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 21U),            /*!< Tx buffer 21 transmission cancel finished interrupt */
    CAN_INT_TXBUF22_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 22U),            /*!< Tx buffer 22 transmission cancel finished interrupt */
    CAN_INT_TXBUF23_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 23U),            /*!< Tx buffer 23 transmission cancel finished interrupt */
    CAN_INT_TXBUF24_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 24U),            /*!< Tx buffer 24 transmission cancel finished interrupt */
    CAN_INT_TXBUF25_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 25U),            /*!< Tx buffer 25 transmission cancel finished interrupt */
    CAN_INT_TXBUF26_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 26U),            /*!< Tx buffer 26 transmission cancel finished interrupt */
    CAN_INT_TXBUF27_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 27U),            /*!< Tx buffer 27 transmission cancel finished interrupt */
    CAN_INT_TXBUF28_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 28U),            /*!< Tx buffer 28 transmission cancel finished interrupt */
    CAN_INT_TXBUF29_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 29U),            /*!< Tx buffer 29 transmission cancel finished interrupt */
    CAN_INT_TXBUF30_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 30U),            /*!< Tx buffer 30 transmission cancel finished interrupt */
    CAN_INT_TXBUF31_CANCELLED                 = CAN_REGIDX_BIT(TXBCIE_REG_OFFSET, 31U),            /*!< Tx buffer 31 transmission cancel finished interrupt */
    /* CAN_DMU_DMUIE interrupts */
    DMU_INT_TX_ELE_NOT_STADDR                 = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 0U),              /*!< TX element not start address interrupt */
    DMU_INT_TX_ELE_ILLE_ENQ                   = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 1U),              /*!< TX element illegal enqueueing interrupt */
    DMU_INT_TX_ELE_ILLE_ACCSEQ                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 2U),              /*!< TX element illegal access sequence interrupt */
    DMU_INT_TX_ELE_ILLE_DLC                   = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 3U),              /*!< TX element illegal DLC interrupt */
    DMU_INT_TX_ELE_WRITE_AFTTRIG              = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 4U),              /*!< TX element write after trigger address interrupt */
    DMU_INT_TX_ELE_ILLE_READ                  = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 5U),              /*!< TX element illegal read interrupt */
    DMU_INT_TX_ELE_ENQ                        = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 6U),              /*!< TX element enqueued interrupt */
    DMU_INT_RX0_ELE_NOT_STADDR                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 8U),              /*!< RX0 element not start address interrupt */
    DMU_INT_RX0_ELE_ILLE_DEQ                  = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 9U),              /*!< RX0 element illegal dequeueing interrupt */
    DMU_INT_RX0_ELE_ILLE_ACCSEQ               = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 10U),             /*!< RX0 element illegal access sequence interrupt */
    DMU_INT_RX0_ELE_ILLE_WRITE                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 11U),             /*!< RX0 element illegal write interrupt */
    DMU_INT_RX0_ELE_DEQ                       = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 12U),             /*!< RX0 element dequeued interrupt */
    DMU_INT_RX1_ELE_NOT_STADDR                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 16U),             /*!< RX1 element not start address interrupt */
    DMU_INT_RX1_ELE_ILLE_DEQ                  = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 17U),             /*!< RX1 element illegal dequeueing interrupt */
    DMU_INT_RX1_ELE_ILLE_ACCSEQ               = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 18U),             /*!< RX1 element illegal access sequence interrupt */
    DMU_INT_RX1_ELE_ILLE_WRITE                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 19U),             /*!< RX1 element illegal write interrupt */
    DMU_INT_RX1_ELE_DEQ                       = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 20U),             /*!< RX1 element dequeued interrupt */
    DMU_INT_TXEV_ELE_NOT_STADDR               = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 24U),             /*!< TX event element not start address interrupt */
    DMU_INT_TXEV_ELE_ILLE_DEQ                 = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 25U),             /*!< TX event element illegal dequeueing interrupt */
    DMU_INT_TXEV_ELE_ILLE_ACCSEQ              = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 26U),             /*!< TX event element illegal access sequence interrupt */
    DMU_INT_TXEV_ELE_ILLE_WRITE               = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 27U),             /*!< TX event element illegal write interrupt */
    DMU_INT_TXEV_ELE_DEQ                      = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 28U),             /*!< TX event element dequeued interrupt */
    DMU_INT_ILLE_ACC_IN_CONFIG                = CAN_REGIDX_BIT(DMUIE_REG_OFFSET, 30U)              /*!< illegal access while in configuration mode interrupt */
} can_dtmcan_interrupt_enum;

/* parameter types */
typedef enum {
    CAN_INIT_STRUCT                  = 0U,                                                /*!< basic CAN initialization structure */
    CAN_FD_INIT_STRUCT               = 1U,                                                /*!< CAN FD (Flexible Data-rate) initialization structure */
    CAN_FILTER_STRUCT                = 2U,                                                /*!< CAN message filter configuration structure */
    CAN_FILTER_ELEMENT_STRUCT        = 3U,                                                /*!< ID filter element structure */
    CAN_RX_MESSAGE_STRUCT            = 4U,                                                /*!< received message structure */
    CAN_TX_MESSAGE_STRUCT            = 5U,                                                /*!< transmit message structure */
    CAN_TX_BUFFER_STRUCT             = 6U,                                                /*!< transmit buffer configuration structure */
    CAN_TXEV_FIFO_STRUCT             = 7U,                                                /*!< transmit event FIFO structure */
    CAN_TXEV_ELEMENT_STRUCT          = 8U,                                                /*!< transmit event FIFO element structure */
    CAN_RX_FIFO_STRUCT               = 9U,                                                /*!< receive FIFO configuration structure */
    CAN_RX_BUFFER_STRUCT             = 10U,                                               /*!< receive buffer configuration structure */
    CAN_HIGHPRI_MESSAGE_STATE_STRUCT = 11U,                                               /*!< high priority message state structure */
    CAN_ERR_COUNT_STRUCT             = 12U,                                               /*!< error counter structure */
    CAN_DMU_QUEUE_COUNT_STRUCT       = 13U                                                /*!< DMU queue counter structure */
} can_struct_type_enum;

/* structure definitions */
/* CAN message structure */
typedef struct {
    uint32_t id : 29;                                                                     /*!< identifier */
    uint32_t rtr : 1;                                                                     /*!< remote transmission request */
    uint32_t xtd : 1;                                                                     /*!< extended ID or standard ID */
    uint32_t esi : 1;                                                                     /*!< error state indicator */
    uint32_t timestamp : 16;                                                              /*!< timestamp */
    uint32_t dlc : 4;                                                                     /*!< data length code in bytes */
    uint32_t brs : 1;                                                                     /*!< bit rate switch */
    uint32_t fdf : 1;                                                                     /*!< FD format indicator */
    uint32_t reserve1 : 2;                                                                /*!< reserve bits 1 */
    uint32_t filter_index : 7;                                                            /*!< index of matching Rx acceptance filter element */
    uint32_t non_match : 1;                                                               /*!< accepted non-matching frame */
    uint8_t data[64];                                                                     /*!< data */
    uint32_t data_bytes;                                                                  /*!< data bytes */
} can_receive_message_struct;

/* CAN transmit message structure */
typedef struct {
    uint32_t id;                                                                          /*!< identifier */
    can_frame_type_enum rtr;                                                              /*!< remote transmission request */
    can_ff_enum xtd;                                                                      /*!< extended ID or standard ID */
    ControlStatus fdf;                                                                    /*!< FD format indicator */
    ControlStatus brs;                                                                    /*!< bit rate switch */
    uint8_t esi;                                                                          /*!< error state indicator */
    uint8_t ev_fifo_control;                                                              /*!< event FIFO control */
    uint16_t message_marker;                                                              /*!< wide message marker */
    uint8_t data[64];                                                                     /*!< transmit data */
    uint32_t data_bytes;                                                                  /*!< data bytes */
} can_transmit_message_struct;

