sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN filter parameter structure */
typedef struct {
    uint32_t and_mask_ext_frame;                                                          /*!< extended ID AND mask which is ANDed with the Message ID of a received frame */
    uint8_t non_match_std_frame_accept;                                                   /*!< received messages with 11-bit IDs that do not match any element of the filter list treatment */
    uint8_t non_match_ext_frame_accept;                                                   /*!< received messages with 29-bit IDs that do not match any element of the filter list treatment */
    uint8_t remote_std_frame_accept;                                                      /*!< filter or reject remote frames with 11-bit IDs */
    uint8_t remote_ext_frame_accept;                                                      /*!< filter or reject remote frames with 29-bit IDs */
    uint16_t filter_start_address_std_frame;                                              /*!< filter start address of 11-bit IDs */
    uint16_t filter_start_address_ext_frame;                                              /*!< filter start address of 29-bit IDs */
    uint8_t filter_number_std_frame;                                                      /*!< filter number of 11-bit IDs */
    uint8_t filter_number_ext_frame;                                                      /*!< filter number of 29-bit IDs */
} can_filter_struct;

/* CAN filter element parameter structure */
typedef struct {
    can_filter_type_enum filter_type;                                                     /*!< filter type for 29-bit IDs */
    can_filter_element_enum config;                                                       /*!< filter element configuration for 29-bit IDs */
    uint32_t id1;                                                                         /*!< extended filter ID1 */
    uint32_t id2_or_mask_or_rxbuffercfg;                                                  /*!< extended filter ID2 or ID1 mask or for Rx buffer store configuration */
} can_filter_element_struct;

/* CAN Rx FIFOx parameter structure */
typedef struct {
    uint16_t fifo_operation_mode;                                                         /*!< FIFO operation mode */
    uint16_t fifo_watermark;                                                              /*!< FIFO watermark */
    uint16_t fifo_size;                                                                   /*!< FIFO size */
    uint16_t fifo_start_address;                                                          /*!< start address of Rx FIFOx in message RAM */
    uint16_t fifo_element_size;                                                           /*!< FIFO data field size */
} can_rx_fifo_struct;

/* CAN Rx buffer parameter structure */
typedef struct {
    uint16_t buffer_start_address;                                                        /*!< start address of Rx buffer in message RAM */
    uint16_t buffer_element_size;                                                         /*!< Rx buffer data field size */
} can_rx_buffer_struct;

/* CAN Tx buffer parameter structure */
typedef struct {
    uint16_t tx_buffer_start_address;                                                     /*!< start address of Tx buffer in message RAM */
    uint16_t dedicate_buffer_size;                                                        /*!< number of dedicated transmit buffers */
    uint16_t fifo_or_queue_mode;                                                          /*!< except dedicated transmit buffers, others operate in Tx FIFO or Tx queue mode */
    uint16_t fifo_or_queue_size;                                                          /*!< number of Tx buffers used for Tx FIFO / queue */
    uint16_t tx_buffer_element_size;                                                      /*!< Tx buffer data field size */
} can_tx_buffer_struct;

/* CAN Tx event FIFO parameter structure */
typedef struct {
    uint16_t fifo_watermark;                                                              /*!< FIFO watermark */
    uint16_t fifo_size;                                                                   /*!< FIFO size */
    uint16_t fifo_start_address;                                                          /*!< start address of Tx event FIFO in message RAM */
} can_tx_event_fifo_struct;

/* Tx event FIFO element structure */
typedef struct {
    uint32_t id : 29;                                                                     /*!< identifier */
    uint32_t rtr : 1;                                                                     /*!< remote transmission request */
    uint32_t xtd : 1;                                                                     /*!< extended identifier */
    uint32_t esi : 1;                                                                     /*!< error state indicator */
    uint32_t dlc;                                                                         /*!< data length code */
    uint32_t data_length;                                                                 /*!< data length */
    uint8_t fdf;                                                                          /*!< FD format */
    uint8_t brs;                                                                          /*!< bit rate switch */
    can_tx_ev_type_enum event_type;                                                       /*!< event type */
    uint16_t message_marker;                                                              /*!< message marker */
    uint16_t timestamp;                                                                   /*!< Tx timestamp */
} can_txev_fifo_element_struct;

/* CAN initialize parameters structure */
typedef struct {
    ControlStatus auto_retransmission_enable;                                             /*!< automatic retransmission */
    ControlStatus transmit_pause_enable;                                                  /*!< transmit pause */
    ControlStatus edge_filter_enable;                                                     /*!< edge filter enable*/
    ControlStatus protocol_exception_enable;                                              /*!< protocol exception enable */
    ControlStatus wide_message_enable;                                                    /*!< 16-bit wide message mark enable */
    uint32_t prescaler;                                                                   /*!< baudrate prescaler */
    uint32_t resync_jump_width;                                                           /*!< resynchronization jump width */
    uint32_t time_segment_1;                                                              /*!< time segment 1 */
    uint32_t time_segment_2;                                                              /*!< time segment 2 */
    can_filter_struct *filter_config;                                                     /*!< filter configuration */
    can_rx_fifo_struct *rx_fifo0_config;                                                  /*!< Rx FIFO0 configuration */
    can_rx_fifo_struct *rx_fifo1_config;                                                  /*!< Rx FIFO1 configuration */
    can_rx_buffer_struct *rx_buffer_config;                                               /*!< Rx buffer configuration */
    can_tx_buffer_struct *tx_buffer_config;                                               /*!< Tx buffer configuration */
    can_tx_event_fifo_struct *tx_event_fifo_config;                                       /*!< Tx event FIFO configuration */
} can_parameter_struct;

/* FD initialize parameter structure */
typedef struct {
    ControlStatus iso_can_fd_enable;                                                      /*!< ISO CAN FD protocol enable */
    ControlStatus bitrate_switch_enable;                                                  /*!< data bit rate switch */
    ControlStatus tdc_enable;                                                             /*!< transmitter delay compensation enable */
    uint32_t tdc_offset;                                                                  /*!< transmitter delay compensation offset */
    uint32_t tdc_filter_window;                                                           /*!< transmitter delay compensation filter window length */
    uint32_t prescaler;                                                                   /*!< baudrate prescaler */
    uint32_t resync_jump_width;                                                           /*!< resynchronization jump width */
    uint32_t time_segment_1;                                                              /*!< time segment 1 */
    uint32_t time_segment_2;                                                              /*!< time segment 2 */
} can_fd_parameter_struct;

/* FD protocol state inforamtion structure */
typedef struct {
    FlagStatus protocol_exp;                                                              /*!< protocol exception event occurred */
    FlagStatus fd_message_received;                                                       /*!< message in CAN FD format with FDF flag set has been received */
    FlagStatus brs_of_last_rx;                                                            /*!< last received CAN FD message had its BRS flag set */
    FlagStatus esi_of_last_rx;                                                            /*!< last received CAN FD message had its ESI flag set */
    can_error_enum data_phase_errcode;                                                    /*!< data phase last error code */
} can_fd_protocol_status_struct;

/* CAN protocol state inforamtion structure */
typedef struct {
    FlagStatus bus_off;                                                                   /*!< bus_off status */
    FlagStatus error_warning;                                                             /*!< warning status */
    FlagStatus error_passive;                                                             /*!< error_passive state */
    can_activity_enum node;                                                               /*!< CAN communication state */
    can_error_enum errcode;                                                               /*!< last error code */
} can_protocol_status_struct;

