sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN high priority message state parameter structure */
typedef struct {
    uint32_t storage_addr;                                                                /*!< message storage address */
    uint32_t match_filter_addr;                                                           /*!< matching filter address */
    int storage_indicator;                                                                /*!< indicator of message storage */
} can_high_prio_message_state_struct;

/* CAN communication error counter structure */
typedef struct {
    uint8_t rx_err_cnt;                                                                   /*!< RX error counter */
    uint8_t tx_err_cnt;                                                                   /*!< TX error counter */
    uint8_t err_logging;                                                                  /*!< CAN error logging */
    FlagStatus rx_err_passive;                                                            /*!< receive error passive flag */
} can_error_cnt_struct;

/* DMU queue counter structure */
typedef struct {
    uint8_t tx_enqueue_cnt;                                                               /*!< TX element enqueueing counter */
    uint8_t rx0_dequeue_cnt;                                                              /*!< RX0 element dequeueing counter */
    uint8_t rx1_dequeue_cnt;                                                              /*!< RX1 element dequeueing counter */
    uint8_t tx_event_dequeue_cnt;                                                         /*!< TX event element dequeueing counter */
} can_dmu_queue_cnt_struct;

/* DMU internal structure */
typedef struct {
    uint32_t txr : 1;                                                                     /*!< TX service request line, indicates a TX request is pending */
    uint32_t rx0r : 1;                                                                    /*!< RX0 service request line, indicates an RX0 FIFO message is pending */
    uint32_t rx1r : 1;                                                                    /*!< RX1 service request line, indicates an RX1 FIFO message is pending */
    uint32_t txer : 1;                                                                    /*!< TX event service request line, indicates a TX event is pending */
    uint32_t reserved1 : 4;                                                               /*!< reserved bits 1 */
    uint32_t tx_fq_put_index_pre : 5;                                                     /*!< TX FIFO/Queue put index previous, indicates the last TX buffer index used */
    uint32_t reserved2 : 2;                                                               /*!< reserved bits 2 */
    uint32_t dmu_en : 1;                                                                  /*!< DMU enable status, indicates whether the DMU is enabled */
    uint32_t reserved3 : 8;                                                               /*!< reserved bits 3 */
    uint32_t dmu_elem_handler_state : 3;                                                  /*!< DMU element handler state, indicates the current state of the element handler */
    uint32_t tx_serve : 1;                                                                /*!< TX service status, indicates the TX service is being handled */
    uint32_t rx0_serve : 1;                                                               /*!< RX0 service status, indicates the RX0 service is being handled */
    uint32_t rx1_serve : 1;                                                               /*!< RX1 service status, indicates the RX1 service is being handled */
    uint32_t txe_serve : 1;                                                               /*!< TX event service status, indicates the TX event service is being handled */
} can_dmu_internal_struct;

/* defines for Tx buffer element size */
#define GET_TXESC_TBDS(regval)         GET_BITS((regval),0,2)                             /*!< get TX buffer element size */
#define TXESC_TBDS(regval)             (BITS(0,2) & ((uint32_t)(regval) << 0U))           /*!< write value to CAN_M_CAN_TXESC_TBDS bit field */
#define CAN_TXBS_8BYTES                ((uint16_t)0x0000U)                                /*!< TX buffer element size: 8 bytes data field */
#define CAN_TXBS_12BYTES               ((uint16_t)0x0001U)                                /*!< TX buffer element size: 12 bytes data field */
#define CAN_TXBS_16BYTES               ((uint16_t)0x0002U)                                /*!< TX buffer element size: 16 bytes data field */
#define CAN_TXBS_20BYTES               ((uint16_t)0x0003U)                                /*!< TX buffer element size: 20 bytes data field */
#define CAN_TXBS_24BYTES               ((uint16_t)0x0004U)                                /*!< TX buffer element size: 24 bytes data field */
#define CAN_TXBS_32BYTES               ((uint16_t)0x0005U)                                /*!< TX buffer element size: 32 bytes data field */
#define CAN_TXBS_48BYTES               ((uint16_t)0x0006U)                                /*!< TX buffer element size: 48 bytes data field */
#define CAN_TXBS_64BYTES               ((uint16_t)0x0007U)                                /*!< TX buffer element size: 64 bytes data field */

/* defines for Rx FIFO element size */
#define CAN_RXFS_8BYTES                ((uint16_t)0x0000U)                                /*!< RX FIFO element size: 8 bytes data field */
#define CAN_RXFS_12BYTES               ((uint16_t)0x0001U)                                /*!< RX FIFO element size: 12 bytes data field */
#define CAN_RXFS_16BYTES               ((uint16_t)0x0002U)                                /*!< RX FIFO element size: 16 bytes data field */
#define CAN_RXFS_20BYTES               ((uint16_t)0x0003U)                                /*!< RX FIFO element size: 20 bytes data field */
#define CAN_RXFS_24BYTES               ((uint16_t)0x0004U)                                /*!< RX FIFO element size: 24 bytes data field */
#define CAN_RXFS_32BYTES               ((uint16_t)0x0005U)                                /*!< RX FIFO element size: 32 bytes data field */
#define CAN_RXFS_48BYTES               ((uint16_t)0x0006U)                                /*!< RX FIFO element size: 48 bytes data field */
#define CAN_RXFS_64BYTES               ((uint16_t)0x0007U)                                /*!< RX FIFO element size: 64 bytes data field */

/* defines for Rx buffer element size */
#define CAN_RXBS_8BYTES                ((uint16_t)0x0000U)                                /*!< RX buffer element size: 8 bytes data field */
#define CAN_RXBS_12BYTES               ((uint16_t)0x0001U)                                /*!< RX buffer element size: 12 bytes data field */
#define CAN_RXBS_16BYTES               ((uint16_t)0x0002U)                                /*!< RX buffer element size: 16 bytes data field */
#define CAN_RXBS_20BYTES               ((uint16_t)0x0003U)                                /*!< RX buffer element size: 20 bytes data field */
#define CAN_RXBS_24BYTES               ((uint16_t)0x0004U)                                /*!< RX buffer element size: 24 bytes data field */
#define CAN_RXBS_32BYTES               ((uint16_t)0x0005U)                                /*!< RX buffer element size: 32 bytes data field */
#define CAN_RXBS_48BYTES               ((uint16_t)0x0006U)                                /*!< RX buffer element size: 48 bytes data field */
#define CAN_RXBS_64BYTES               ((uint16_t)0x0007U)                                /*!< RX buffer element size: 64 bytes data field */

/* defines for non matching frames acceptance */
#define CAN_ACCEPT_INTO_RXFIFO0        ((uint8_t)0x00U)                                   /*!< acceptance non-matching frames into Rx FIFO 0 */
#define CAN_ACCEPT_INTO_RXFIFO1        ((uint8_t)0x01U)                                   /*!< acceptance non-matching frames into Rx FIFO 1 */
#define CAN_REJECT_NON_MATCHING        ((uint8_t)0x02U)                                   /*!< rejection non-matching frames */

/* defines for remote frames acceptance */
#define CAN_REMOTE_FILTER              ((uint8_t)0x00U)                                   /*!< filter remote standard frames */
#define CAN_REMOTE_REJECT              ((uint8_t)0x01U)                                   /*!< reject all remote standard frames */

