sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* defines for non-matching frame acceptance indicator */
#define CAN_NON_MATCH_FRAME            ((uint32_t)0x00000001U)                            /*!< accepted non-matching frame */
#define CAN_MATCH_FILTER_FRAME         ((uint32_t)0x00000000U)                            /*!< frame matched a filter element */

/* defines for bitrate switch */
#define CAN_BRS_ENABLE                 ((uint32_t)0x00000001U)                            /*!< enable bitrate switch */
#define CAN_BRS_DISABLE                ((uint32_t)0x00000000U)                            /*!< disable bitrate switch */

/* defines for event FIFO control */
#define CAN_TXEVENT_FIFO_STORE         ((uint8_t)0x01U)                                   /*!< store tx event FIFO element */
#define CAN_TXEVENT_FIFO_DISABLE       ((uint8_t)0x00U)                                   /*!< do not store tx event FIFO element */

/* defines for TXFQS.TFQM behavior of Tx FIFO/Queue */
#define CAN_TXFIFO_OPERATION           ((uint32_t)0x00000000U)                            /*!< Tx FIFO operation */
#define CAN_TXQUEUE_OPERATION          CAN_M_CAN_TXBC_TFQM                                /*!< Tx Queue operation */

/* defines for Rx FIFO operation mode */
#define CAN_RXFIFO_BLOCKING            ((uint32_t)0x00000000U)                            /*!< FIFO blocking mode */
#define CAN_RXFIFO_OVERWRITE           CAN_M_CAN_RXFXC_FOM                                /*!< FIFO overwrite mode */

/* CAN_M_CAN_DBTP register */
#define DBTP_DSJW(regval)              (BITS(0,3) & ((uint32_t)(regval) << 0U))           /*!< write value to CAN_M_CAN_DBTP_DSJW bit field */
#define DBTP_DTSEG2(regval)            (BITS(4,7) & ((uint32_t)(regval) << 4U))           /*!< write value to CAN_M_CAN_DBTP_DTSEG2 bit field */
#define DBTP_DTSEG1(regval)            (BITS(8,12) & ((uint32_t)(regval) << 8U))          /*!< write value to CAN_M_CAN_DBTP_DTSEG1 bit field */
#define DBTP_DBRP(regval)              (BITS(16,20) & ((uint32_t)(regval) << 16U))        /*!< write value to CAN_M_CAN_DBTP_DBRP bit field */

/* CAN_M_CAN_TEST register */
#define CAN_TEST_TXBUF_LAST_STARTED    ((uint32_t)0x00000000U)                            /*!< Tx buffer number which started last */
#define CAN_TEST_TXBUF_LAST_PREPARED   ((uint32_t)0x00000001U)                            /*!< Tx buffer number which prepared last */
#define TEST_TX(regval)                (BITS(5,6) & ((uint32_t)(regval) << 5U))           /*!< write value to CAN_M_CAN_TEST_TX bit field */

/* CAN_M_CAN_NBTP register */
#define NBTP_NTSEG2(regval)            (BITS(0,6) & ((uint32_t)(regval) << 0U))           /*!< write value to CAN_M_CAN_NBTP_NTSEG2 bit field */
#define NBTP_NTSEG1(regval)            (BITS(8,15) & ((uint32_t)(regval) << 8U))          /*!< write value to CAN_M_CAN_NBTP_NTSEG1 bit field */
#define NBTP_NBRP(regval)              (BITS(16,24) & ((uint32_t)(regval) << 16U))        /*!< write value to CAN_M_CAN_NBTP_NBRP bit field */
#define NBTP_NSJW(regval)              (BITS(25,31) & ((uint32_t)(regval) << 25U))        /*!< write value to CAN_M_CAN_NBTP_NSJW bit field */

/* CAN_M_CAN_ECR register */
#define GET_ECR_TEC(regval)            GET_BITS((regval),0,7)                             /*!< get transmit error counter */
#define GET_ECR_REC(regval)            GET_BITS((regval),8,14)                            /*!< get receive error counter */
#define GET_ECR_CEL(regval)            GET_BITS((regval),16,23)                           /*!< get CAN error logging */

/* CAN_M_CAN_SIDFC register */
#define SIDFC_FLSSA(regval)            (BITS(2,15) & ((uint32_t)(regval) << 2U))          /*!< write value to CAN_M_CAN_SIDFC_FLSSA bit field */
#define SIDFC_LSS(regval)              (BITS(16,23) & ((uint32_t)(regval) << 16U))        /*!< write value to CAN_M_CAN_SIDFC_LSS bit field */
#define GET_SIDFC_FLSSA(regval)        GET_BITS((regval),2,15)                            /*!< get standard identifier filter start address */
#define GET_SIDFC_LSS(regval)          GET_BITS((regval),16,23)                           /*!< get standard identifier filter number */

/* CAN_M_CAN_XIDFC register */
#define XIDFC_FLESA(regval)            (BITS(2,15) & ((uint32_t)(regval) << 2U))          /*!< write value to CAN_M_CAN_XIDFC_FLESA bit field */
#define XIDFC_LSE(regval)              (BITS(16,22) & ((uint32_t)(regval) << 16U))        /*!< write value to CAN_M_CAN_XIDFC_LSE bit field */
#define GET_XIDFC_FLESA(regval)        GET_BITS((regval),2,15)                            /*!< get extended identifier filter start address */
#define GET_XIDFC_LSE(regval)          GET_BITS((regval),16,22)                           /*!< get extended identifier filter number */

/* CAN_M_CAN_XIDAM register */
#define XIDAM_EIDM(regval)             (BITS(0,28) & ((uint32_t)(regval) << 0U))          /*!< write value to CAN_M_CAN_XIDAM_EIDM bit field */

/* CAN_M_CAN_HPMS register */
#define GET_HPMS_BIDX(regval)          GET_BITS((regval),0,5)                             /*!< get index of Rx FIFO element */
#define GET_HPMS_MSI(regval)           GET_BITS((regval),6,7)                             /*!< get message storage indicator */
#define GET_HPMS_FIDX(regval)          GET_BITS((regval),8,14)                            /*!< get index of matching filter element */

/* CAN_M_CAN_GFC register */
#define GFC_ANFE(regval)               (BITS(2,3) & ((uint32_t)(regval) << 2U))           /*!< write value to CAN_M_CAN_GFC_ANFE bit field */
#define GFC_ANFS(regval)               (BITS(4,5) & ((uint32_t)(regval) << 4U))           /*!< write value to CAN_M_CAN_GFC_ANFS bit field */

/* CAN_M_CAN_RXFxC register */
#define GET_RXFXC_FSA(regval)          GET_BITS((regval),2,15)                            /*!< get Rx FIFO x start address */
#define RXFXC_FSA(regval)              (BITS(2,15) & ((uint32_t)(regval) << 2U))          /*!< write value to CAN_M_CAN_RXFxC_FSA bit field */
#define RXFXC_FS(regval)               (BITS(16,22) & ((uint32_t)(regval) << 16U))        /*!< write value to CAN_M_CAN_RXFxC_FS bit field */
#define RXFXC_FWM(regval)              (BITS(24,30) & ((uint32_t)(regval) << 24U))        /*!< write value to CAN_M_CAN_RXFxC_FWM bit field */

/* CAN_M_CAN_RXFxS register */
#define GET_RXFXS_FXGI(regval)         GET_BITS((regval),8,13)                            /*!< get Rx FIFO x get index */
#define GET_RXFXS_FXPI(regval)         GET_BITS((regval),16,21)                           /*!< get Rx FIFO x put index */

