sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_M_CAN_RXESC register */
#define GET_RXESC_F0DS(regval)         GET_BITS((regval),0,2)                             /*!< get Rx FIFO 0 element size */
#define GET_RXESC_F1DS(regval)         GET_BITS((regval),4,6)                             /*!< get Rx FIFO 1 element size */
#define GET_RXESC_RBDS(regval)         GET_BITS((regval),8,10)                             /*!< get Rx buffer element size */
#define RXESC_F0DS(regval)             (BITS(0,2) & ((uint32_t)(regval) << 0U))           /*!< write value to CAN_M_CAN_RXESC_F0DS bit field */
#define RXESC_F1DS(regval)             (BITS(4,6) & ((uint32_t)(regval) << 4U))           /*!< write value to CAN_M_CAN_RXESC_F1DS bit field */
#define RXESC_RBDS(regval)             (BITS(8,10) & ((uint32_t)(regval) << 8U))          /*!< write value to CAN_M_CAN_RXESC_RBDS bit field */

/* CAN_M_CAN_RXBC register */
#define GET_RXBC_RBSA(regval)          GET_BITS((regval),2,15)                             /*!< get Rx buffer start address */
#define RXBC_RBSA(regval)              (BITS(2,15) & ((uint32_t)(regval) << 2U))          /*!< write value to CAN_M_CAN_RXBC_RBSA bit field */

/* CAN_M_CAN_TXBC register */
#define GET_TXBC_TBSA(regval)         GET_BITS((regval),2,15)                             /*!< get Tx buffers start address */
#define GET_TXBC_NDTB(regval)         GET_BITS((regval),16,21)                            /*!< get number of dedicated transmit buffers */
#define TXBC_TBSA(regval)             (BITS(2,15) & ((uint32_t)(regval) << 2U))           /*!< write value to CAN_M_CAN_TXBC_TBSA bit field */
#define TXBC_NDTB(regval)             (BITS(16,21) & ((uint32_t)(regval) << 16U))         /*!< write value to CAN_M_CAN_TXBC_NDTB bit field */
#define TXBC_TFQS(regval)             (BITS(24,29) & ((uint32_t)(regval) << 24U))         /*!< write value to CAN_M_CAN_TXBC_TFQS bit field */

/* CAN_M_CAN_TXEFC register */
#define GET_TXEFC_EFSA(regval)         GET_BITS((regval),2,15)                             /*!< get Tx FIFO element start address */
#define TXEFC_EFSA(regval)            (BITS(2,15) & ((uint32_t)(regval) << 2U))           /*!< write value to CAN_M_CAN_TXEFC_EFSA bit field */
#define TXEFC_EFS(regval)             (BITS(16,21) & ((uint32_t)(regval) << 16U))         /*!< write value to CAN_M_CAN_TXEFC_EFS bit field */
#define TXEFC_EFWM(regval)            (BITS(24,29) & ((uint32_t)(regval) << 24U))         /*!< write value to CAN_M_CAN_TXEFC_EFWM bit field */

/* CAN_M_CAN_TXEFS register */
#define GET_TXEFS_EFGI(regval)        GET_BITS((regval),8,12)                             /*!< get Tx event FIFO get index */
#define GET_TXEFS_EFPI(regval)        GET_BITS((regval),16,20)                            /*!< get Tx event FIFO put index */

/* CAN_M_CAN_TXFQS register */
#define GET_TXFQS_TFGI(regval)        GET_BITS((regval),8,12)                             /*!< get Tx FIFO get index */
#define GET_TXFQS_TFQPI(regval)       GET_BITS((regval),16,20)                            /*!< get Tx FIFO/Queue put index */

/* standard filter element */
#define SFET_SFID2(regval)            (BITS(0,10) & ((uint32_t)(regval) << 0))            /*!< write value to standard filter element table SFID2 bit field */
#define SFET_SFID1(regval)            (BITS(16,26) & ((uint32_t)(regval) << 16))          /*!< write value to standard filter element table SFID1 bit field */
#define SFET_SFEC(regval)             (BITS(27,29) & ((uint32_t)(regval) << 27U))         /*!< write value to standard filter element table SFEC bit field */
#define SFET_SFT(regval)              (BITS(30,31) & ((uint32_t)(regval) << 30U))         /*!< write value to standard filter element table SFT bit field */

/* extended filter element */
#define EFET_EFID1(regval)            (BITS(0,28) & ((uint32_t)(regval) << 0))            /*!< write value to extended filter element table EFID1 bit field */
#define EFET_EFEC(regval)             (BITS(29,31) & ((uint32_t)(regval) << 29U))         /*!< write value to extended filter element table EFEC bit field */
#define EFET_EFID2(regval)            (BITS(0,28) & ((uint32_t)(regval) << 0))            /*!< write value to extended filter element table EFID2 bit field */
#define EFET_EFT(regval)              (BITS(30,31) & ((uint32_t)(regval) << 30U))         /*!< write value to extended filter element table EFT bit field */

/* CAN_M_CAN_PSR register */
#define GET_PSR_TDCV(regval)          GET_BITS((regval),0,6)                              /*!< get transmitter delay compensation value */
#define CAN_M_CAN_PSR_HIGH(dtm_canx)  REG16((dtm_canx) + 0x46U)                           /*!< M_CAN protocol status register high bytes */
#define CAN_M_CAN_PSR_BYTE2(dtm_canx) REG8((dtm_canx) + 0x45U)                            /*!< M_CAN protocol status register byte 2 */

/* CAN_M_CAN_TDCR register */
#define TDCR_TDCF(regval)             (BITS(0,6) & ((uint32_t)(regval) << 0))             /*!< write value to CAN_M_CAN_TDCR_TDCF bit field */
#define TDCR_TDCO(regval)             (BITS(8,14) & ((uint32_t)(regval) << 8U))           /*!< write value to CAN_M_CAN_TDCR_TDCO bit field */

/* CAN_M_CAN_TSCC register */
#define TSCC_TCP(regval)              (BITS(16,19) & ((uint32_t)(regval) << 16))          /*!< write value to CAN_M_CAN_TSCC_TCP bit field */

/* CAN_M_CAN_TOCC register */
#define TOCC_TOP(regval)              (BITS(16,31) & ((uint32_t)(regval) << 16))          /*!< write value to CAN_M_CAN_TOCC_TOP bit field */

/* CAN_DMU_DMUQC register */
#define GET_DMUQC_TXEEC(regval)       GET_BITS((regval),0,7)                              /*!< get TX element enqueueing counter */
#define GET_DMUQC_RX0EDC(regval)      GET_BITS((regval),8,15)                             /*!< get RX0 element dequeueing counter*/
#define GET_DMUQC_RX1EDC(regval)      GET_BITS((regval),16,23)                            /*!< get RX1 element dequeueing counter */
#define GET_DMUQC_TXEEDC(regval)      GET_BITS((regval),24,31)                            /*!< get TX event element dequeueing counter */

/* Tx event FIFO element */
#define E1A_DLC(regval)               (BITS(16,19) & ((uint32_t)(regval) << 16))          /*!< write value to data length code */

/* CAN_NCERRR register */
#define GET_NCERRR_NCERA(regval)      GET_BITS((regval),0,10)                             /*!< get noncorrectable error record address */

