sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* CAN_CERRRx register */
#define GET_CERRR_CERA(regval)        GET_BITS((regval),0,10)                             /*!< get correctable error record address */

/* defines for timestamp select */
#define CAN_TS_DISABLE                ((uint32_t)0x00000000U)                             /*!< timestamp counter disable */
#define CAN_TS_INTERNAL               ((uint32_t)0x00000001U)                             /*!< timestamp counter enabled, internal count value */

/* defines for timeout operation mode */
#define TOCC_TOS(regval)              (BITS(1,2) & ((uint32_t)(regval) << 1U))            /*!< write value to CAN_M_CAN_TOCC_TOS bit field */

/* DMU element handler state values */
#define DMU_EHS_WAIT4CCE              ((uint32_t)0x00000000U)                             /*!< wait for bit M_CAN:CAN_M_CAN_CCCR.CCE getting zero */
#define DMU_EHS_WAIT4SA               ((uint32_t)0x00000001U)                             /*!< wait for Start Address */
#define DMU_EHS_WAIT4TA               ((uint32_t)0x00000002U)                             /*!< wait for Trigger Address */
#define DMU_EHS_TRANSFER              ((uint32_t)0x00000003U)                             /*!< wait for transfer of Element word */
#define DMU_EHS_ACK2MCAN              ((uint32_t)0x00000004U)                             /*!< acknowledge to M_CAN */
#define DMU_EHS_RECOVERY              ((uint32_t)0x00000005U)                             /*!< exception recovery */

/* CAN interrupt line number definition */
#define CAN_INTR_LINE0                ((uint8_t)0x00U)                                    /*!< CAN interrupt line 0 */
#define CAN_INTR_LINE1                ((uint8_t)0x01U)                                    /*!< CAN interrupt line 1 */

/* function declarations */
/* initialization functions */
/* deinitialize CAN */
void can_deinit(can_dtm_canx_enum dtm_canx);
/* initialize CAN parameter structure with a default value */
void can_struct_para_init(can_struct_type_enum type, void *p_struct);
/* initialize CAN */
ErrStatus can_init(can_dtm_canx_enum dtm_canx, can_parameter_struct *can_parameter);
/* get SRAM initialization state */
FlagStatus can_sram_init_state_get(can_dtm_canx_enum dtm_canx);
/* add message ID filter element */
ErrStatus can_filter_set(can_dtm_canx_enum dtm_canx, can_ff_enum frame_format, uint8_t element_index, can_filter_element_struct *filter);

/* operating mode related functions */
/* enable selected operating mode */
ErrStatus can_operating_mode_enable(can_dtm_canx_enum dtm_canx, can_operating_mode_enum mode);
/* disable selected operating mode */
ErrStatus can_operating_mode_disable(can_dtm_canx_enum dtm_canx, can_operating_mode_enum mode);
/* enable automatic retransmission */
void can_automatic_retransmission_enable(can_dtm_canx_enum dtm_canx);
/* disable automatic retransmission */
void can_automatic_retransmission_disable(can_dtm_canx_enum dtm_canx);

/* test mode related functions */
/* get Tx buffer number from CAN_M_CAN_TEST register */
uint8_t can_test_txbuffer_number_get(uint32_t dtm_canx, uint32_t number_type);
/* configure CAN transmit pin output */
void can_test_transmit_pin_output_config(uint32_t dtm_canx, can_tx_control_enum tx_control);
/* get CAN receive pin state */
FlagStatus can_test_receive_pin_state_get(uint32_t dtm_canx);

/* CAN FD mode related functions */
/* set CAN FD operation mode */
void can_fd_config(can_dtm_canx_enum dtm_canx, can_fd_parameter_struct *can_fd_para_init);
/* disable CAN FD mode */
void can_fd_disable(can_dtm_canx_enum dtm_canx);
/* get transmitter delay compensation value */
uint16_t can_tdc_get(can_dtm_canx_enum dtm_canx);
/* configure transmitter delay compensation */
void can_tdc_config(can_dtm_canx_enum dtm_canx, ControlStatus enable, uint8_t offset, uint8_t filter_window);
/* enable edge filtering during bus integration */
void can_edge_filtering_enable(can_dtm_canx_enum dtm_canx);
/* disable edge filtering during bus integration */
void can_edge_filtering_disable(can_dtm_canx_enum dtm_canx);
/* enable protocol exception handling */
void can_protocol_exception_enable(can_dtm_canx_enum dtm_canx);
/* disable protocol exception handling */
void can_protocol_exception_disable(can_dtm_canx_enum dtm_canx);

/* CAN_SYSREG related configuration functions */
/* enable 'disable modification on read' function for DTM_CAN */
void can_dismodify_on_read_enable(can_dtm_canx_enum dtm_canx);
/* disable 'disable modification on read' function for DTM_CAN */
void can_dismodify_on_read_disable(can_dtm_canx_enum dtm_canx);
/* enable clock stop request for DTM_CAN */
void can_clock_stop_request_enable(can_dtm_canx_enum dtm_canx);
/* disable clock stop request for DTM_CAN */
void can_clock_stop_request_disable(can_dtm_canx_enum dtm_canx);
/* get clock stop acknowledge for DTM_CAN */
FlagStatus can_clock_stop_acknowledge_get(can_dtm_canx_enum dtm_canx);
/* enable DMA request for DTM_CAN */
void can_dma_request_enable(can_dtm_canx_enum dtm_canx);
/* disable DMA request for DTM_CAN */
void can_dma_request_disable(can_dtm_canx_enum dtm_canx);

/* share SRAM related functions */
/* enable CAN_MERRCTL register write access */
void can_merrctl_write_access_enable(can_dtm_canx_enum dtm_canx);
/* disable CAN_MERRCTL register write access */
void can_merrctl_write_access_disable(can_dtm_canx_enum dtm_canx);
/* enable error report and error status update */
ErrStatus can_ecc_enable(can_dtm_canx_enum dtm_canx);
/* disable error report and error status update */
ErrStatus can_ecc_disable(can_dtm_canx_enum dtm_canx);
/* get memory error status */
FlagStatus can_memory_error_status_get(can_dtm_canx_enum dtm_canx, can_memory_error_index_enum index);
/* get memory error address */
uint32_t can_memory_error_address_get(can_dtm_canx_enum dtm_canx, can_memory_error_index_enum index);
/* clear CAN_CERRR0 - CAN_CERRR3, and CAN_NCERRR register record */
void can_memory_error_record_clear(can_dtm_canx_enum dtm_canx);
/* configure the message RAM watchdog counter */
void can_sram_watchdog_config(uint32_t dtm_canx, uint8_t counter);
/* get message RAM watchdog counter value */
uint8_t can_sram_watchdog_counter_get(uint32_t dtm_canx);

