sorosaulong-ux/gd32-test-project/Library/gd32a7xx_can.h
/* timeout and timestamp functions */
/* timeout configuration */
void can_timestamp_timeout_prescaler_config(can_dtm_canx_enum dtm_canx, uint16_t prescaler);
/* enable CAN timestamp */
void can_timestamp_enable(can_dtm_canx_enum dtm_canx);
/* disable CAN timestamp */
void can_timestamp_disable(can_dtm_canx_enum dtm_canx);
/* reset CAN timestamp counter value */
void can_timestamp_reset(can_dtm_canx_enum dtm_canx);
/* enable timeout counter */
void can_timeout_enable(can_dtm_canx_enum dtm_canx, can_timeout_mode_enum timeout_mode, uint16_t timeout_period);
/* disable timeout counter */
void can_timeout_disable(can_dtm_canx_enum dtm_canx);
/* get timeout counter value */
uint16_t can_timeout_value_get(can_dtm_canx_enum dtm_canx);
/* restart CAN timeout counter value */
void can_timeout_restart(can_dtm_canx_enum dtm_canx);

/* FIFO functions */
/* get Tx FIFO / Tx queue free level */
uint8_t can_tx_fifo_free_level_get(can_dtm_canx_enum dtm_canx);
/* get Tx FIFO / Tx event FIFO / Rx FIFO get index */
uint8_t can_fifo_get_index_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type);
/* get Tx FIFO / Tx queue / Tx event FIFO / Rx FIFO put index */
uint8_t can_fifo_put_index_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type);
/* get Tx FIFO / Tx queue / Tx event FIFO / Rx FIFO full state */
FlagStatus can_fifo_full_state_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type);
/* get Tx event FIFO / Rx FIFO fill level */
uint8_t can_fifo_fill_level_get(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type);
/* acknowledge Tx event FIFO / Rx FIFO messages */
void can_fifo_acknowledge(can_dtm_canx_enum dtm_canx, can_fifo_type_enum fifo_type);
/* read a Tx event FIFO element */
void can_txev_fifo_read(can_dtm_canx_enum dtm_canx, can_txev_fifo_element_struct *txevent);

/* transmit functions */
/* configure CAN transmission message */
uint8_t can_message_transmit_prepare(can_dtm_canx_enum dtm_canx, can_transmit_message_struct *transmit_message);
/* add an transmission request */
void can_message_transmit_add(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer);
/* cancel an transmission request */
ErrStatus can_message_transmit_cancel(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer);
/* get an transmission status */
FlagStatus can_message_transmit_status_get(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer);
/* get an transmission pending status */
FlagStatus can_message_transmit_pending_status_get(can_dtm_canx_enum dtm_canx, uint8_t tx_buffer);
/* pack CAN transmission message for DMU Tx transmission */
ErrStatus can_dmu_message_transmit_prepare(can_dtm_canx_enum dtm_canx, can_transmit_message_struct *transmit_message, uint32_t dmu_tx[], uint32_t array_size);

/* receive functions */
/* release Rx buffer */
void can_rx_buffer_release(can_dtm_canx_enum dtm_canx, uint8_t buffer_index);
/* get CAN receive message */
void can_message_receive(can_dtm_canx_enum dtm_canx, can_storage_type_enum storage_type, can_receive_message_struct *receive_message);
/* get high priority message state */
can_high_prio_message_state_struct can_high_priority_message_state_get(can_dtm_canx_enum dtm_canx);
/* get high priority CAN message */
can_receive_message_struct can_high_priority_message_receive(can_high_prio_message_state_struct high_message);

/* error status */
/* get CAN FD protocol status information */
can_fd_protocol_status_struct can_fd_protocol_state_info_get(can_dtm_canx_enum dtm_canx);
/* get CAN protocol state information */
can_protocol_status_struct can_protocol_state_info_get(can_dtm_canx_enum dtm_canx);
/* get CAN error counter */
can_error_cnt_struct can_communication_error_counter_get(can_dtm_canx_enum dtm_canx);

/* DMU counter functions */
/* get all DMU queueing counters */
can_dmu_queue_cnt_struct can_dmu_queue_counter_get(can_dtm_canx_enum dtm_canx);
/* reset all DMU counters */
void can_dmu_counter_reset(can_dtm_canx_enum dtm_canx);
/* get DMU internal finite state machine */
can_dmu_internal_struct can_dmu_internal_fsm_get(can_dtm_canx_enum dtm_canx);

/* interrupt configuration */
/* configure CAN interrupt line */
void can_mcan_interrupt_line_config(can_dtm_canx_enum dtm_canx, uint8_t line_number, can_dtmcan_interrupt_enum interrupt);
/* enable CAN interrupt line */
void can_mcan_interrupt_line_enable(can_dtm_canx_enum dtm_canx, uint8_t line_number);
/* disable CAN interrupt line */
void can_mcan_interrupt_line_disable(can_dtm_canx_enum dtm_canx, uint8_t line_number);

/* interrupt & flag */
/* get CAN memory error flag */
FlagStatus can_memerr_flag_get(can_dtm_canx_enum dtm_canx, can_memerr_flag_enum flag);
/* clear CAN memory error flag */
void can_memerr_flag_clear(can_dtm_canx_enum dtm_canx, can_memerr_flag_enum flag);
/* enable or disable memory ecc interrupt */
void can_memerr_interrupt_enable(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_enum interrupt);
/* disable CAN interrupt */
void can_memerr_interrupt_disable(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_enum interrupt);
/* get CAN interrupt flag */
FlagStatus can_memerr_interrupt_flag_get(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_flag_enum int_flag);
/* clear CAN interrupt flag */
void can_memerr_interrupt_flag_clear(can_dtm_canx_enum dtm_canx, can_memerr_interrupt_flag_enum int_flag);

/* get CAN flag */
FlagStatus can_flag_get(can_dtm_canx_enum dtm_canx, can_dtmcan_flag_enum flag);
/* clear CAN flag */
void can_flag_clear(can_dtm_canx_enum dtm_canx, can_dtmcan_flag_enum flag);
/* enable CAN interrupt */
void can_interrupt_enable(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_enum interrupt);
/* disable CAN interrupt */
void can_interrupt_disable(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_enum interrupt);
/* get CAN interrupt flag */
FlagStatus can_interrupt_flag_get(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_flag_enum int_flag);
/* clear CAN interrupt flag */
void can_interrupt_flag_clear(can_dtm_canx_enum dtm_canx, can_dtmcan_interrupt_flag_enum int_flag);

#endif /* GD32A7XX_CAN_H */